{"/_index_ori/":{"data":{"":"An open-source, easy to use, and accessible blockchain for you!","documentation#Documentation":"For more information, visit Hextra.","explore#Explore":" Docs About Left Card Center Card Right Card "},"title":"Bismuth - Abstract Blockchain Wizardry"},"/about/":{"data":{"":"","#":"Bismuth: The First Python Blockchain Bismuth is a modular, efficient, and innovative blockchain protocol built entirely from a fresh Python codebase—unlike most cryptocurrencies that stem from Bitcoin or its derivatives. Inspired by foundational ideas from Satoshi Nakamoto (BitCoin), and other blockchains like Peercoin, NXT and Ethereum, Bismuth reimagines blockchain technology with simplicity, accessibility, and scalability in mind.\nA Unique Approach to Blockchain Technology Unlike traditional blockchain implementations, Bismuth does not borrow code from existing repositories. Instead, it redefines cryptocurrency logic in a clean and readable way, ensuring seamless cross-platform compatibility, easy business integration, and accessibility for developers of all skill levels—all while minimizing security risks in custom implementations.\nDecentralized, Scalable, and Feature-Rich Bismuth is a decentralized transaction platform designed for flexibility. It comes with built-in decentralized applications (DApps) and tools that can be used and hosted by anyone. These applications operate as interpretation engines, preventing blockchain bloat and maintaining efficiency.\nTo optimize performance, Bismuth introduces Hyperblocks, an innovative pruning mechanism inspired by Satoshi’s whitepaper. This feature significantly reduces disk space usage while improving execution speed.\nPrivacy \u0026 On-Chain Features Bismuth offers built-in on-chain messaging and data storage, both in public and encrypted forms. With Tor support and optinal privacy enhancing DApps, it delivers robust privacy features for users seeking enhanced security and privacy.\nA Growing Ecosystem Originally launched as a personal project to explore blockchain technology, Bismuth quickly grew into a feature-rich cryptocurrency and platform, supported by a diverse community of developers, pool operators, exchanges, and blockchain enthusiasts.\nThe Bismuth Genesis Block was launched on May 1, 2017, marking the beginning of a continuously evolving ecosystem.\nModular by Design, Scalable by Nature As both a blockchain protocol and platform, Bismuth introduces a novel approach to database scaling. It supports private contracts, limiting execution to participating users while ensuring public verifiability through alternative mechanisms. With a vast selection of open-source projects, plugin-based scalability, and selective node behavior, Bismuth enables limitless expansion and custom layer development.\nBismuth is more than just a cryptocurrency—it’s an adaptable, forward-thinking blockchain designed for real-world applications."},"title":"About Bismuth"},"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/blog/2019-05-17-hard-fork-v4.3.0.0/":{"data":{"":" Over the past couple of months, Bismuth has undergone major shifts- technologically, socially, and economically. We witnessed a massive upgrade and restructuring of the core code that spanned over 200 commits, that was finalized in version 4.2.9.2 in late March of this year.\nFast forward to the start of May, and we made our first announcement for Hyperlanes- an infinitely scaling form of direct data exchange between nodes which enables the inter-connectivity of the future- coined “Internet Within Blockchain”. We have made strides in expanding our team to include new members that are actively assisting in areas where we were weakest. Although most of this goes under the radar, the effects of it all should be felt over the coming weeks and months.\nEconomically and socially, the overall bear market has caused much turmoil within the entirety of the cryptocurrency community. The Bismuth project wasn’t spared and unfortunately received the brunt of the market downturn as we have witnessed a precipitous drop from the peak in early 2018. Although the Bismuth foundation cannot exert control over the free market, there are factors and variables that can be adjusted by the development team when consensus within the community is reached. One of such factors is the inflation question, which has been widely debated within our social channels and internally.\nInflation is a delicate topic, as it is both one of the prime drivers in market forces, as well as the incentive that helps propagate the blockchain and network forward. It is an issue that must be approached with care, as radical changes can result in degrading the robust security Bismuth has built-up over the past couple of years. However, inflation itself can drastically sabotage the market if left unchecked. This has left the Bismuth foundation to develop a strategic hard fork that takes all factors into mind while moving forward.\nOn block 1,200,000 (early June), a strategic hard fork has been scheduled that introduces new emission rules for mining and the Hypernode network. The hard fork will introduce a strategic miner reward reduction that shifts the inflation curve more than 18 months forward. This reduction will set the miner block reward to be 1.6 BIS less than the current emission rate, which equates to an immediate 13.5% reduction in miner emission.\nOn the contrary, the hard fork will bring forth a substantial increase to Hypernode reward payouts. A flat 200% increase in emission will be introduced, bringing up the current per-block reward of 0.8 BIS to 2.4 BIS. The current ROI for running a Hypernode is 11.7% per annum, which was unsatisfactory when compared to the net inflation. With the introduction of the reward hike, this figure gets bumped up to 35.1% per annum, and makes Bismuth a viable investment vehicle for prospective individuals that wish to run Hypernodes.\nAs the number of active Hypernodes increase, the network will reciprocally become more competitive and the expected profitability will decrease. However, to reach the old ROI rate of 11.7% per annum, the Hypernode network capacity would have to increase by 7,200,000 BIS, not counting the existing figure (3,250,000 BIS at time of writing) locked in Hypernodes. In total, over 58% of the current circulating supply would have to get locked in order to return to the old rate of 11.7%.\nAs the Hypernode network expands, it becomes a more and more viable parallel network for utilitarian purposes. Bismuth is the leading platform for Python development in the blockchain industry, and Python itself is the world’s most popular and fastest growing programming language. With those factors coupled together, the Bismuth project retains some of the largest growth potential in the entire industry, and can tap into the intellectual capital of millions of Python developers. The possibilities are endless, as we move forward to build the virtual infrastructure that will provide the utility of the digital world.\nSigned, The Bismuth Foundation\nYou can give feedback and ask your questions about this fork via the following form: https://framaforms.org/bismuth-fork-questions-1558081292 This will be used as basis for an upcoming Q\u0026A post.","references#References":" Markdown Syntax Hugo Markdown "},"title":"Bismuth Strategic Hard Fork v4.3.0.0"},"/blog/2019-07-03-supply/":{"data":{"":"","#":" When designing the coin supply and rewards model for a cryptocurrency, there are many factors to take into consideration.\nBismuth Coin Supply and Rewards Model Some of the factors are:\nAmount to sell in ICO (Initial Coin Offering) Pre-mine amount Development rewards Miner rewards (for POW coins) Forger rewards (for POS coins) Hypernodes/Masternode rewards When the Bismuth project started, the following coin supply and rewards model was chosen:\nNo ICO No pre-mine Development rewards equal to 10% of miners rewards The figure below shows the initial rewards model in blue color. The formula for the miners rewards was: 15-x/1e6 where x is the block height. This means the mining reward was decreasing linearly with time, unlike the btc abrupt halvings.\nAt block height 800,000 Bismuth’s Hypernodes were launched, and at the same time the rewards model was modified. The miners rewards formula was modified to make it decrease faster. As seen from the figure below (red curve) the miners rewards decrease twice as fast as previously while the 0.8 taken from the miners were allocated to Hypernode rewards instead (green curve below).\nAt block height 1,200,000 Bismuth’s reward formulas were modified again, to reward hypernodes relatively more compared to miners, see the figure below. The amount of 1.6 BIS per block were subtracted from the miners reward and added to the hypernodes rewards. The overall inflation was reduced only marginally because of this change.\nPython code to calculate Bismuth’s coin supply is available at the following link: https://github.com/bismuthfoundation/Bismuth-FAQ/tree/master/CoinSupply\nThe Bismuth blockchain started May 1, 2017 and the inflation rates during the following 10 years are shown in the table below:\nYear Inflation 1 ∞ 2 93.2% 3 38.9% 4 25.5% 5 18.4% 6 13.9% 7 10.8% 8 8.4% 9 6.6% 10 5.0% As seen from this table, the inflation is quite high initially while it rapidly drops to 5.0% in year 10. One reason for the relatively high initial inflation is the fact that Bismuth had no pre-mine or ICO: The total coin supply started at zero at the Genesis block (block height 0). Naturally, the inflation will initially be large with such a distribution model. Some motivations behind this coin supply and rewards model is to ensure a fair distribution model of Bismuth in the early phase, while at the same time attract miners to secure the chain with their hash rates. As the project matures, holding Bismuth for the long-term is encouraged by the rapidly falling inflation rates.\nThe long-term plan for Bismuth is to increase the usage of the Hypernodes, for dApps and other services. Hence, as the project matures, the Hypernode operators will be rewarded with an increasingly larger portion of the overall rewards compared to the miners. The Hypernode rewards are a constant 2.4 BIS per block while the miners rewards continuously decrease. However, as the platform matures and gets more and more used, fees from the user transactions will compensate the miners for the drop of emission. If the Bismuth project becomes successful, the miners revenue may actually increase over time because of the increased level of fees.\nThe introduction of Hypernodes to the Bismuth project has been an overall success so far, for the following reasons:\nIt did not result in a lowering of the miners rewards too much It resulted in an attractive return-of-investment (ROI) for the Hypernode holders. At the time of writing it is around 28% annually It led to a large number of hypernodes, at the time of writing approximately 180 active nodes and as a result a significant percentage of locked supply At the time of writing approximately 4.5m BIS or almost 25% of the entire coin supply is locked in collateral by the hypernodes.\nBitcoin Rewards, Coin Supply and Inflation The Bismuth rewards and coin supply model is compared with Bitcoin, the original cryptocurrency. Bitcoin was chosen for comparison, because this coin had no ICO and no pre-mine, just like Bismuth. The plots below show the Bitcoin block rewards which started at 50 BTC and halved every 210,000 blocks. The total coin supply in Bitcoin will eventually reach approximately 21 million BTC.\nThe Bitcoin blockchain started January 2009 and the inflation rates during the following 10 years are shown in the table below:\nYear Inflation 1 ∞ 2 100.0% 3 50.0% 4 33.3% 5 12.1% 6 11.5% 7 10.0% 8 9.0% 9 4.2% 10 4.0% As seen from this table, although the numbers are different, the reduction in inflation rate from year to year is quite similar between Bitcoin and Bismuth.\nZcash Rewards, Coin Supply and Inflation Another cryptocurrency which is interesting to compare with Bismuth is Zcash, since it is largely limited to GPU mining rigs, just like Bismuth. The block rewards in Zcash started on 0.000625 ZEC and ramped up linearly to a block reward of 12.5 ZEC occuring at block height 20,000. Just like Bitcoin, Zcash has a reward halving. The blocktime in Zcash is 2,5 minutes, four times faster than Bitcoin. Hence, to achieve the same coin supply as Bitcoin with an upper limit of 21 million ZEC, the halving period measured in blocks for Zcash is every 840,000 blocks, 4 times higher than Bitcoin’s halving period. The halving period measured in days is the same for Zcash as for Bitcoin, since both the blocktime and the halving period have the factor 4 and cancel each other out. From the initial reward of 12.5 ZEC, 2.5 ZEC or 20% goes to the founders (core developers), as compared to 10% for the Bismuth project. The following two figures show the linear ramp up in Zcash block rewards and the total coin supply vs. block height.\nThe Zcash blockchain started on October 28, 2016 and the inflation rates during the following 10 years are shown in the table below:\nYear Inflation 1 ∞ 2 105.0% 3 51.2% 4 33.8% 5 32.7% 6 20.2% 7 11.2% 8 9.1% 9 4.2% 10 4.0% As seen from this table the inflation model in Zcash is the same as Bitcoin. However, since Zcash is a relatively new project it will have quite high inflation rates in 2019 (about 50%) compared to Bitcoin which has an inflation of less than 4.0% in 2019, since it is a much more mature project which has reached year 10 in the inflation curve.\nEthereum Rewards, Coin Supply and Inflation The cryptocurrency Ethereum has taken a different approach to block rewards. Initially, the block reward started out at 5 ETH. At block height 4,370,000 the reward dropped to 3 ETH in the Byzantium hardfork. At the upcoming Constantinople hardfork the plan is to reduce the block reward further to 2 ETH, see EWN Article. At the time of writing this reward reduction has not yet happened, but for the analysis below we will assume that this adjustment will be made at block height 7,500,000 and stay at 2 ETH indefinitely.\nWith these assumptions the Ethereum block rewards and the total coin supply vs. block height are shown in the two figures below.\nThe Ethereum blockchain started on July 30, 2015 and the inflation rates during the following 10 years are shown in the table below:\nYear Inflation 1 14.6% 2 12.7% 3 7.1% 4 5.4% 5 4.0% 6 3.8% 7 3.7% 8 3.6% 9 3.5% 10 3.3% Ethereum differs from Bitcoin, Zcash and Bismuth because it had an initial ICO of 72 million ETH, while the other 3 projects did not have an ICO. Ethereum is also different with block rewards which are not programmed to decrease, as is the case with Bitcoin, Zcash and Bismuth. So far, reduction of ETH block rewards has required hardforks, and it has only happened once so far (Byzantium) and another one planned (Constantinople). The use of an ICO (or pre-mine) results naturally in lower inflation rates for the following years. However, investors in such a project have to trust that the developers fund is not constantly sold on the market, otherwise that could have the same effect as a large inflation. It can be noted that Bismuth’s reward curve is a combination of the methods used by Bitcoin and Ethereum: 1) Programmed, falling reward curve as the block height increases and 2) Adjustment of inflation level at a few distinct block heights (hard forks).\nGrin Rewards, Coin Supply and Inflation Grin is a new cryptocurrency project launched in 2019. The currency has 1 minute block time, 60 GRIN block reward and no limit on coin supply or reward halving. There are no ICO, founders reward, pre-mine or masternodes available for this project. The block reward stays at 60 GRIN indefinitely.\nThe block rewards and the total coin supply vs. block height for GRIN are shown in the two figures below.\nAs can be seen from the plots above, GRIN is an inflationary cryptocurrency with no upper limit on the total coin supply. The inflation rates for such a currency, especially when the coin supply starts at zero, are naturally expected to be high. The table below shows the inflation rates for the first 10 years of this project:\nThe GRIN blockchain started on January 15, 2019 and the inflation rates during the following 10 years are shown in the table below:\nYear Inflation 1 ∞ 2 100.0% 3 50.0% 4 33.3% 5 25.0% 6 20.0% 7 16.7% 8 14.3% 9 12.5% 10 11.1% 10 years into the projects, the cryptocurrencies studied in this blog have the following inflation levels:\nEthereum = 3.3% Bitcoin = 4.0% Zcash = 4.0% Bismuth = 5.3% GRIN = 11.1% The analysis shows that the Bismuth inflation can be considered as slightly above average in the crypto world. However, Bismuth’s block rewards are decreasing and the inflation rates are far below cryptocurrencies which start with a coin supply of zero and have constant block rewards, such as GRIN. Such projects will have an inflation rate at 11.1% after 10 years, more than double Bismuth’s inflation rate at that time. Note also that mature projects like Bitcoin, which have existed for 10 years or more, will naturally have lower inflation levels than younger projects which have only existed for a few years. The use of an initial ICO or pre-mine will also make the inflation numbers smaller, however this observation may be deceptive if the developers are constantly selling coins to fund their work or take out profits from the project.\nNot everyone sees inflation as bad. In this article (https://arstechnica.com/information-technology/2014/02/dogecoin-to-allow-annual-inflation-of-5-billion-coins-each-year-forever/) for example it is stated: As long as it’s at a steady and predictable rate, you would want that inflation rate to more or less match the growth of the global economy, James Angel, a finance professor at Georgetown University, told Ars. In order for a currency to survive, it’s got to be useful. One of the problems we learned with gold standard was that it’s too inflexible – it takes too long for gold miners to dig it up out of the ground. Having a nice, steady, predictable money supply is actually a good thing.\nThe inflation rates of different cryptocurrencies have, in general, little effect on the price movement of the coins. The table below shows the annual price movement of the coins during the period 2013-2018.\nYear Bitcoin Bismuth Zcash Ethereum 2013 442% 2014 -59% 2015 38% -64% 2016 123% 742% 2017 1319% 226% 905% 918% 2018 -82% -92% -88% -82% From the data shown above there seems to be little correlation between a cryptocurrency’s inflation levels and the future price movement. For example, during the period 2016-2018 the cryptocurrency Ethereum had a 6 times higher price increase measured in USD compared to Bitcoin, despite the fact that Ethereum had a doubling in the coin supply during this period compared to only 18% increase in the coin supply for Bitcoin.\nOther factors, such as promised and delivered features, stability of the blockchain, marketing efforts and the quality and size of the development team are believed to have a much higher influence on the price movements than inflation levels and total coin supply.","references#References":" Bismuth Coin Supply EWN Article Arstechnica Article "},"title":"Coin Supply"},"/blog/2019-08-29-governance-shift-part_1/":{"data":{"":"","#":" During the first two and a half years of the Bismuth blockchain project, important governance actions have been decided by the group of foundation members. Now the core team finds it is time to involve the community deeper into governance questions, and make more use of community feedback.\nThe Bismuth project has had a very active Discord community since the beginning, and it is seen as a very valuable resource for the project and it makes sense to consult the community more than in the past for input on important decisions. Therefore, the foundation members have decided to introduce a shift in the governance, by letting the stakeholders involved vote on important decisions concerning the future of the project.\nDiscord alone however can’t be seen as a source of actionable feedback:\nNot everyone is active there. Some voices do flood day after day with the same suggestions (count as one, no matter how many times you repeat yourself). Not all suggestions are well presented and actionable. You can’t map a discord user to a Bismuth User (unless some flavor or KYC or associated wallets with Discord ids). Twitter polls are also totally un-trustable:\nLike with Discord, you do not reach everyone. You can’t map a Twitter user to a Bismuth user (unless KYC/ de-pseudonymization). Twitter polls are easily manipulable, there are plenty of services to buy votes. So, the core team came to realize that if Discord is ok to gather some feedback and proposals, if everyone’s voice is to be heard and a decision in the common interest is to be taken, the voting process has to go further than that.\nUntil then, the Bismuth team was the only responsible entity for core changes, like the introduction of the Hypernodes and related rewards, and later on, the move of some part of the mining reward toward Hypernodes. The Team always had in mind the long term success of the project, and took every class of user point of view into account before deciding: investors, miners, devs, etc.\nNow, the core team feels that the time has come to let users hold their responsibilities and take the decision for everyone’s best interest, via a voting process. The team would prepare options to vote upon, the users will decide, the team will take action based on the final voting results.\nThe first vote in Bismuth History If you are familiar with the discord, you cannot avoid the economists lobbying for a supply modification.\nThe latest fork (see here) was tailored to account for increased services to be provided by the Hypernodes, while not raising the dilution. It already went in the direction of reducing miner rewards. Currently the most vocal suggestions aim to address the dropping price concern, and are to significantly reduce the supply by cutting the emission: that is both block rewards and HN rewards.\nThe team ran simulations, examined the available data but still it is not clear what the global implications can be, nor how action or inaction would be welcome by the users and the markets. The problem really is complex with implications at the ethical, economical level, involving the equilibrium of the whole system. The more you dig, the more it appears complex.\nIt looks like it is the perfect case where a community vote is needed and will make sense.\nA voting process can be an equally daunting task, because blockchain based voting is tricky and dangerous. The difficulty is two fold:\nA – What is “one” vote? Blockchains usually are non-KYC (Know Your Customer) and anonymous or pseudonymous. One user can have many addresses. Some do require KYC (Like Tezos), that’s a road the core team does not want to take. So you never can map one vote to one user. Even if you could, voters could be bribed.\nIs a vote one address? One coin? One IP address? One hash unit? In any case, you could pretend you have several voices when all are yours. B – Will I vote for the best common interest? In a blockchain context, you can have several classes of people with different objectives. For Bismuth for instance, a Proof-of-Work (PoW) utility token, you can think of:\nThe miners. The holders. The dApps developers. The core foundation team. Each of these classes can have a different egoistic goal when speaking of chain governance. Just as a quick illustration, miners would like higher fees or block rewards, holders want less dilution and more marketing, dapps developers want low fees and fast blocks, core team wants the token to go mainstream, be secure and used in the real world.\nGame theory shows that this can lead to votes that are counter productive for the chain as a whole (see “tragedy of the commons“, this is somehow related).\nEthereum Case – Carbonvote Before presenting the proposed Bismuth voting model, an example vote based on the Ethereum blockchain is briefly discussed. In order to decide about the “ice age” issue, ETH owners could vote on a motion to delay it.\nHow did it work?\nEvery address could vote, address balance = vote weight. 0 ETH sent, but consumes gas. You could change your vote anytime, or move ETH to change your vote weight. The current, real time state of the vote was public at carbonvote.com. The core team feels this model has several flaws, that can be deduced from the voting protocol.\nGives advantage to holders, exchanges and service providers (the higher your wallet balance, the more your weight). Public votes, real time stats, means you can play mind games, swap votes last moment and heavily influence the whole process. Users do vote but take no real risk, no responsibility. They have nothing to gain or lose if they don’t care about the results. You can be bribed to vote. In a next article, you’ll be presented the Bismuth Governance Voting Model (BGVM), which is a novel protocol to address fair voting in the context of blockchain governance, and addresses the issues we just saw with the naive protocol above.","references#References":" Markdown Syntax Hugo Markdown ","summary#Summary":"The Bismuth team will begin to introduce governance to help decide about some core Bismuth choices.\nA novel voting process was designed and will be used.\nThe first issue stakeholders will be able to vote upon is the need or not to change the core supply metrics."},"title":"Bismuth Governance Shift - Part 1"},"/blog/2019-08-30-governance-shift-part_2/":{"data":{"":"","#":"\nPreamble In the previous post, the governance shift that is to take place with Bismuth was introduced, and the ETH voting protocol was examined. It was shown that this protocol does come with several issues that could be important flaws in the Bismuth context.\nIssues with the ETH voting protocol There is nothing at stake. You do not directly win or lose anything by voting (just some gas) Exchanges as well as shared services, dev funds, and founders have a huge voting power The holders are by definition the ones getting the most votes, so the issue is likely to be in favor of the holders group, and potentially detrimental to others and the coin in general. Since the votes are public, it allows for any kind of psychological manipulation by influence groups. You could pretend to vote for the other group, so other users are not incited to vote as it appears there is a clear winner. Then swap votes at the very last moment. Influence groups can play mind games. You do not vote “your best”, you just vote enough so your group wins. You can bribe big balances who do not care to vote for your group, they have nothing to lose, so why not take the bribe and vote? Many users could also be bribed to vote against their long term interest: they would get the bribe right now, and have nothing immediate to lose. In the case of Bismuth, mean exchanges – including Cryptopia’s inactive wallet – or one entity – including the core team – could vote and have chances to impose their own decisions.\nAn alternate voting protocol Now comes a description of the Bismuth Governance Voting Model (BGVM). The goal is to have voters put their money where their mouth is. With this protocol:\nYou only vote for something you really want to happen. You do take risks, you have to show your motivation. Your vote is not an empty word, the core team is not the only one wetting the shirt. Every category has a similar weight and cost to vote. Big balances are not over-represented. Still, the richest wallets can have the most weight, and are also the ones benefiting from a higher future price. You help finance the project you voted for. There is no bribe advantage. If you lose, you can still be happy. There is no possible mind games nor manipulation until the vote is over. The voters involvement is known in real time The issue of the vote is secret until it is finished. «Bismuth defines a new voting protocol: users have to put their money where their mouth is. Involvement is known in real time but the issue of the vote is secret until over! Good idea?» Click to tweet\nThe protocol The public interface of the protocol is as follows:\nA motion is proposed, with 2 or more options. You vote by sending $BIS + data to the vote address. The amount you send is public, whereas data (your vote) is encrypted and private. The $BIS you send are your voting weight. Their use – should the motion pass – are stated in the motion. Options: You can issue several voting transactions, so you can increase your weight during the voting period. you can invert a previous transaction vote (but not cancel it) should you change your mind. Once the voting period is finished:\nVotes – and related flips – are revealed. If you do not reveal your vote, it cannot be counted, and you do not get your money back. Losers get their $BIS back (less transaction fees). In the winners’ case, their $BIS go into a community fund to be used as stated by the motion. Pros There is no need to bribe people, you would have to bribe them more than by voting yourself. There will be no mind games, the issue is totally opaque until the end. Even the core team does not have access to the results before votes are revealed. You take risks, and only vote for what you really want, because if this happens, your $BIS vote will be used to build it. There is no incentive in voting for the other side, since if it wins, you lose your tokens. Trolls and fudders have no voice, no leverage. Only final $BIS votes count, once revealed. It’s safer for big holders with funds in cold wallet: you don’t have to move your cold funds out to vote. Just vote what you want. Involvement (total amount of $BIS) is known in real time. No need to run a balance vote on one side, then a miner vote by block signaling on the other side: everyone votes with the same protocol, the same unit. You know what the minimum proposal budget will be (at worse, 50.01% of the votes for a vote with 2 options). Every group has the same voting cost/power. Holders do not have more power than miners because they have a higher balance. What everyone bets for is what they risk, should they win. If the miners’ group want to overrule the holders, they do not need to have as much balance as the holders, they just need to vote as much as them. The amount you vote reflects your belief and involvement in the proposal you vote for, and what you are willing to contribute to see it succeed. «Contrary to the Carbonvote process, the #Bismuth “blind” voting protocol renders the vote immune to bribery attacks, and forces users to vote for the long term success of the project. Read more: » Click to tweet\nConclusion The “blind auction” introduced by the innovative and new BGVM avoids the pitfalls of more common voting and blockchain governance mechanisms seen to date. The protocol protects the project’s global interest by allowing everyone to be represented in a fair manner and forces voters to vote for what they really want in the long term, and not for what would give them the most short term advantage. The vote issue is an Oracle whose value is only known once the decision is immutable.\n«The new #Bismuth voting protocol merges carbonvoting and block signaling into a single process where every actor votes with the same process and unit for a fair vote that can not be bribed nor manipulated. Read more: » Click to tweet","references#References":" Markdown Syntax Hugo Markdown "},"title":"Bismuth Governance Shift - Part 2"},"/blog/2019-09-10-bgv-01/":{"data":{"":"","#":" Preamble - This blog article explains the BGV-01 motion and the options you can vote for.\nAbstract Motion: Keep Bismuth supply emission as it currently is (A) , or significantly reduce emission – therefore option (B). Voting period: From 2019-10-01 at 12h00 UTC to 2019-11-01 at 12h00 UTC (block time counts) Vote reveal: From 2019-11-01 at 12h00 UTC to 2019-11-10 at 12h00 UTC If a hardfork is decided, it could take place at block height 1,450,000, approximately on 2019-11-27 (draft timeline has been updated with final values)\nBackground Changing the supply emission of Bismuth is not something to be taken lightly. There are many arguments in favor of both options. Hence, the members of the Bismuth Foundation have decided to make this decision the first community vote to be carried out. There will be two options to vote for:\nA) Keep the status quo, ie. keep the emissions curve as it is currently programmed, or:\nB) Modify the block rewards to significantly reduce the overall dilution.\nOption A: BGV-01/A Do not change the supply, keep emission like it currently is, see the supply post. With Option A the annual dilution per year measured in $BIS starting from block height 1,450,000 (2.5 years into the project) would be:\nYear Percentage Year 1 30.0% Year 2 21.0% Year 3 15.6% Year 4 11.9% Year 5 9.3% Year 6 7.3% Year 7 5.6% Year 8 4.2% Year 9 3.0% Year 10 2.2% Option B: BGV-01/B Radically change the supply emission from block 1,450,000 to lower the dilution and part of the market sell pressure.\nMining (PoW) Block rewards would be lowered from 9.7 to 5.5 (reduction of 43%), but the curve is then decreasing slower. Hypernodes (PoS) rewards would begin to decrease instead of being constant. Overall dilution would be reduced from 30.0% to 19.4%, and decrease up to a tail emission of 2% after 10 years. Long-term lower limits on the rewards have been introduced to give miners and Hypernode owners incentives to remain in the ecosystem. With Option B the annual inflation per year starting from block height 1,450,000 would be:\nYear Percentage Year 1 19.4% Year 2 14.9% Year 3 11.7% Year 4 9.4% Year 5 7.6% Year 6 6.1% Year 7 4.9% Year 8 3.8% Year 9 2.9% Year 10 2.0% Implications:\nFor holders: less dilution, one of the components of the sell pressure goes down. For Hypernodes owners: no immediate change in the rewards, but on the long run Hypernodes rewards will decrease. Still, because of the dilution drop, the Hypernodes yield in the beginning will be higher than the overall dilution rate. For miners: reduction of rewards short term, but more rewards after some time (block height 5,300,000). For dApps: no changes to fees or block times. Graph: (A) vs (B) The current emission curves (Option A) and the proposed modified curves (Option B) and the associated dilution rates are compared in the figure below: Current emission (A) is in Bold, emission for (B) is thinner.\nUse of the winning funds As described in the Bismuth voting protocol, the BIS of the losing side are sent back to their originating wallets, while funds of the winning side are kept in a fund to finance the option. For this motion the winning funds – whatever the issue will be – are to be used as exchange listing and dapps bounties funds.","arguments#Arguments":"Arguments for option A: Cryptocurrencies are supposed to be different from fiat currencies, where central banks regularly adjust monetary policies. See for example this article, where one of the conclusions is: “… cryptocurrencies offer a unique opportunity to engineer long term monetary policy that is carried out in full transparency. Unfortunately, many protocols we’ve looked at do not take advantage of this opportunity, or are prone to change (which defeats the purpose).” Option B, although seemingly radical towards the miners (initial 43% reduction), shifts the emissions curve by approximately one year. The Bismuth Foundation has a long-term perspective, and one year means very little in the grand scheme. The miners play a very important role, by securing the chain with their hash power, and building it in the first place. The PoS chain wouldn’t exist without the PoW chain, and Bismuth is – at core – a PoW chain. By reducing the miners rewards (Option B) there is a high probability that the overall hash power will be reduced. With a reduced overall hash power in the network, the Bismuth blockchain will become more vulnerable to a 51% attack. Should such an attack occur, it is likely to be detrimental for the $BIS price. Bismuth is mainly a PoW coin, with no premine or ICO. It is meaningless to compare its supply model or dilution to pure PoS models, ICOs or premined coins. Supply is just one component of sell pressure. Holders selling when market goes down also play a significant role in sell pressure. Everyone’s time would be put to better use in building the demand side up rather than trying short term hacks with supply. Market could play a more important role than the supply curve. No need to play against the market, better wait for a purge and the next bull run. In order to reduce the dilution, option B requires the PoS rewards – part of the dilution – to decrease instead of being constant. This can be seen as a time bomb for Hypernode owners, unless use-cases based upon the Hypernodes do add new income sources to Hypernode owners. Option A would not require a hardfork, so there is less work for all the network participants (exchanges, pools, Hypernode owners) which all would have to update their nodes if Option B is selected. Arguments for option B: By significantly reducing the miners block rewards – hence dilution – the staking yield for Hypernode owners will initially become net positive (larger than the dilution caused by new coins). By reducing the block rewards some believe that the supply reduction and increased scarcity will help recover the $BIS price, which has fallen significantly in recent times. If the $BIS price would increase by a factor 2x or more after the supply reduction, the miners would be better off measured in USD compared to before, since the miners’ rewards measured in $BIS will initially be reduced by a factor of less than 2x. Option B introduces a long-term lower limit of Hypernode rewards of 0.5 $BIS per block to ensure that the block rewards can never reach zero, meaning the Hypernode owners have an incentive to stay in the ecosystem, in case future fees from use-cases are not sufficient or too irregular. Option B introduces a long-term lower limit of the miners reward of 0.5 $BIS per block to ensure that the block rewards can never reach zero, meaning that the hash power will not disappear in case future network fees are not sufficient or too irregular to reward the miners. With Option B the developer rewards do not go to zero either, but have a lower limit of 0.05 $BIS per block (10% of the miners block rewards), giving the core team a long-term incentive to keep working on and improving the blockchain, it’s ecosystem, as well as a marketing and exchange listing budget. Many blockchain projects have modified their emissions curves recently, including Ethereum which is ranked 2nd in terms of marketcap value. It is believed that these modifications have been made to become more comparable with Bitcoin’s dilution rates. Bitcoin being the first cryptocurrency, has had many years a headstart on other projects, and it has reached the tail end of it’s emission curve. It can be argued that Bismuth must modify its emissions curve too, or be left behind. Many more arguments and discussions can be found on the discord, #trade channel.","references#References":" Bismuth Discord Voting Protocol "},"title":"BGV-01 - Bismuth Governance Vote 1"},"/blog/2019-10-18-voting/":{"data":{"":"","#":" Bismuth community is currently voting whether or not change the supply emission (see BGVP-1). In order to allow easy and un-restricted access to the vote, the team went for a full client side helper to generate voting transactions. This ensures full privacy and allows to vote from any wallet. External help was welcome to get it successfully running and a Bounty will be awarded.\nThe voting helper The voting helper works by using a BIP-39 passphrase as an entropy source, deriving keys (alike a HD wallet) for your voting addresses, then disposable keys for every motion you vote upon.\nFrom a UX point of view: a single passphrase to remind, and you have access to any voting key you’(ll ever need.\nHandling these key generation and transaction assembling on the client side, in a browser, allows for easy and secure access (it’s hosted on Github pages: Bismuth Voting Helper, but can also be run locally or on an air gapped computer) whatever the user OS.\nHelp was needed Bismuth is a Python centered coin, and the team devs do not have extensive experience with JS development.\nA call for help was made to the community, in order to get some back up. We needed a proper scaffold, help with syntax, gluing things together, building and distribution of the helper…\nThe specs were written, a Python implementation was working, we needed more.\nThird party dev to the rescue Hopefully it was not long until @aravindballa said hi and gave a hand.\nThanks to his kind and professional help, the helper was up and running in time for day 1 of the vote.\nThe team did work on the core crypto engine, and Aravind helped scaffold, design, package, test… the whole thing to have it working and usable.\nAravind’s experience proved most useful and the Bismuth team is very grateful for his help!\nBounty A few tips have been sent via the discord Bot, but did not reflect Aravind’s work and implication.\nA 1000 $BIS bounty will be awarded from the dev funds for the help so far.\nConclusion It was really amazing to witness the power and dedication of the Bismuth and open source community. State you problem, ask for help, and you can get invaluable help from users.\nThis is the kind of experience that gives faith in a community and let foresee nice things for the future!\nYou can follow Aravind on twitter: @aravindballa.","references#References":" @aravindballa "},"title":"Voting page Helper - Dev and Bounty"},"/blog/2019-11-06-governance-vote/":{"data":{"":"","#":"\nDecisions are the most crucial part of advancing a project. Without them, ideas lie in-acted upon, development stalls, and instead of progress there is stagnation.\nThe Bismuth Foundation is well aware of the dangerous path of inaction, and has always committed a full effort towards advancing the platform at a steadfast pace. One such large advancements have come into fruition recently, with the conclusion of Bismuth’s first Governance Vote- BGV-01.\nBGV-01 was a motion that combined a new and revolutionary governance protocol with branching decisions that would impact Bismuth on a grand scale – retain the current emission schedule (option A), or significantly reduce it (option B). Throughout October 1st and November 1st of 2019, Bismuth stakeholders could vote on either choice.\nThe results were resoundingly in favor of an inflation cut – option B, with a weight of over 89%, with the remainder 9.5% in support of option A and 1.5% choosing neither. A grand total of 68,952 Bismuth was committed to voting in BGV-01, an extraordinary figure proving the community’s willingness to partake in such motions.\nFrom block 1,450,000, BGV-01 option B will be implemented to vastly lower inflation and supply dilution.\nMining (PoW) Block rewards would be lowered from 9.7 to 5.5 (reduction of 43%), but the curve is then decreasing slower. Hypernodes (PoS) rewards would begin to decrease instead of being constant. Overall dilution would be reduced from 30.0% to 19.4%, and decrease up to a tail emission of 2% after 10 years. Long-term lower limits on the rewards have been introduced to give miners and Hypernode owners incentives to remain in the ecosystem. With Option B the annual inflation per year starting from block height 1,450,000 would be:\nTime Percentage Year 1 19.4% Year 2 14.9% Year 3 11.7% Year 4 9.4% Year 5 7.6% Year 6 6.1% Year 7 4.9% Year 8 3.8% Year 9 2.9% Year 10 2.0% Implications: For holders: less dilution, one of the components of the sell pressure goes down. For Hypernodes owners: no immediate change in the rewards, but on the long run Hypernodes rewards will decrease. Still, because of the dilution drop, the Hypernodes yield in the beginning will be higher than the overall dilution rate. For miners: reduction of rewards short term, but more rewards after some time (block height 5,300,000). For dApps: no changes to fees or block times. The new graph showing the miner, hypernode and dev rewards are shown below. In addition to the reduced emission, lower limits of 0.5 BIS have been put in place for both the miner and hypernode rewards. Since the dev reward is 10% of the miner reward, the lower limit on those will be 0.05 BIS per block. The lower limit will be reached at approximately block height 7,100,000.\nBismuth’s first governance vote was a great success, and the community has spoken to alter Bismuth’s emission schedule for the better. Not only has a major change been decided upon, but it has proven that the BGV protocol is a far more viable and effective voting mechanism compared to what other platforms have created.\nAll exchanges, pools and hypernode operators need to update their nodes by block height 1,450,000 which is expected to take place on November 27, 2019. The new release will be available at the Bismuth Github repository.","references#References":" Bismuth Github repository "},"title":"Outcome of Bismuth’s First Governance Vote"},"/blog/2019-11-19-hardfork/":{"data":{"":" During November 2019 the Bismuth community went with the first governance vote, about supply emission. The issue was overwhelming votes for a fork to support a supply reduction.\nIf you missed it, you can find the link here. Since then, the team worked hard to implement the change and release a stable version, now out. Questions and answers regarding this fork have been divided into three categories- Regular users, Hypernode owners, and miners.","bismuth-hard-fork-at-block-1450000--nov-26#Bismuth Hard Fork at block 1,450,000 – Nov 26.":"Hard Fork FAQ General Questions Q: Can you explain why there will be a hard fork?\nA: A hard fork was scheduled in response to the first Bismuth community vote. It’s the result of a democratic process that showed significant involvement from the Bismuth community.\nQ: When is the Hard Fork taking place?\nA: The HF will occur at block 1,450,000, roughly on November 26.\nRegular Users Q: Do I have to DO anything? New wallet? No swapping BS or anything, right?\nA: Regular wallet owners can optionally upgrade; however, it is not necessary. It will continue to work. Mandatory upgrades apply only to node and Hypernode owners. There is no swap.\nQ: Is it still OK to use the old wallet, or should I upgrade to Tornado?\nA: The “old” (Legacy) wallet remains compatible and usable. You don’t have to worry about the wallet. Yours will continue to work. As a user, the only critical responsibility is to securely back up your wallet.der/json file, containing your private key(s).\nQ: Can you summarize the current daily emission and what it will be after the hard fork?\nA: See the emission curve and blog post here.\nQ: What will be the new total BIS supply?\nA: By 2032, at block height 8,000,000, the total BIS supply will reach 49.3 million BIS, compared to 63.5 million BIS under the previous emissions curve. Thus, the supply will decrease by more than 14 million BIS over the next 13 years. After 2032, the supply will slowly increase (less than 2% annually) to account for lost wallets and maintain incentives for miners and Hypernode operators.\nQ: Can you see a scenario where the chain splits in two?\nA: Every hard fork technically involves a chain split; however, the legacy chain typically dies off due to lack of support. Miners, exchanges, and the economic majority support the v4.4.0 hard fork proposal, so there’s no need to worry about a competing legacy chain.\nQ: Have you informed exchanges to avoid any trading halt, as happened previously?\nA: All partners, exchanges, service operators, and pools have been informed. All recent forks proceeded smoothly without trading halts.\nHypernode and Node Owners Q: After the hard fork, how can I re-operate my Hypernode? Will I need to do anything with my HN?\nA: Every Hypernode relies on a local Node to operate. Hypernodes using version 0.0.99i5 don’t need updating, but the local BIS node does. It’s mandatory to upgrade your node to the latest release BEFORE the fork. Node Releases\nQ: Will there be a Hypernode update tutorial before the hard fork?\nA: Yes. We’ve updated our easy-to-use update script, covering common scenarios:\nRun the following commands in your Hypernode terminal:\nrm hn_node_update.py wget https://raw.githubusercontent.com/bismuthfoundation/util/master/hn_node_update.py python3 hn_node_update.py The script requires Python 3.7 and will prompt you about missing packages if needed. For feedback, visit the Discord #hypernodes channel. Additional manual update instructions can be found here.\nQ: What will be the new annual yield for running a BIS Hypernode after the fork?\nA: Yield depends on the number of Hypernode operators. If total collateral remains stable, the yield will initially stay around 20%, aligning with a 19.4% inflation rate. Hypernode owners will no longer experience dilution post-fork. In the second year, inflation will drop below 15%, potentially leading to net positive income after inflation.\nQ: What if I don’t upgrade in time?\nA: All other BIS nodes will curse then ban you. Immediate upgrading is essential, both for the network’s health and your rewards.\nMiners Q: Do I have anything to do?\nA: No action is required. Pools will update automatically, and mining software doesn’t need upgrading. You can continue mining as before.","references#References":" Github - Pyrtransitions Github - Prysm Wikipedia - Finite State Machine Github - Transitions GUI "},"title":"Bismuth Hard Fork"},"/blog/2019-12-18-interview/":{"data":{"":"","-the-interview#📝 The Interview":"","about-aravind#\u003cstrong\u003eAbout Aravind\u003c/strong\u003e":" Welcome to the BisBabble series! In this issue, we chat with Aravind, a recent contributor to the Bismuth project.\nHe shares insights into his background, interests, and development work.\n📝 The Interview Q: Can you tell us a little about yourself? A: I make sure I taste all the varieties of food being served. 🍽️\nQ: Is programming your day job or a hobby? A: It’s my day job—I work as a JavaScript Developer.\nQ: Code you’re most proud of? A: My personal website (I guess).\nThere’s a module that dynamically generates social media preview images (Open Graph) when the site builds—I really like that part.\nQ: What programming languages have you worked with? C – Learned it, but never liked it. Python – Enjoyed using Django to build things. Java – My first paid job was in Java, but I wasn’t a fan—maybe because of how I learned it in college. Q: You give talks about cutting-edge tech (like Gatsby). Do you see that as part of your job? A: I love sharing what I learn and helping others on their developer journey. That’s why I write a blog, too—it’s a pleasure!\nAlso, I feel noticed in the community when I talk about what I’ve learned.\nI believe everyone should share, because it’s beautiful to see different perspectives—sometimes they open new doors.\nQ: What’s your experience in the crypto field? A: I’d say I’m a beginner who understands what a blockchain is.\nQ: How did you get introduced to blockchain? A:\nIn college, I heard about a guy making money trading crypto. I asked him what a blockchain was—he couldn’t explain it properly. That led me to do some research, but I was still confused. A year ago, I met someone who runs a blockchain-based company. Talking to him gave me clarity and motivated me to learn more. Q: What led you to Bismuth specifically? A: All because of Shadowcrypto.\nQ: Has the perception of crypto changed for you since that college trader? A: Absolutely—a lot has changed.\nFor me, crypto is already influencing the world, but it will take time for people around me to fully adopt it.\nI’ve even read that my state government is using blockchain (not exactly crypto) for certain projects, which is interesting!\nQ: What do you like about Bismuth? A: The community—you all are so nice! 🤗\nAlso, Bismuth is written in Python, the only language I understand apart from JavaScript.\nQ: Most loved programming language \u0026 why? A: JavaScript (of course).\nIt started as just a browser scripting language, but after the V8 engine, it became much more powerful.\nNow, you can write it anywhere:\nWebpages Servers Mobile (Ionic, React Native) IoT devices Learn once, use everywhere! 🚀\nQ: Many modern developers rely on libraries and frameworks (e.g., React, Laravel). Do you see this as a good thing? A: I think it’s a positive evolution (though I could be wrong).\nFrameworks abstract things developers don’t need to worry about, allowing them to focus on business logic.\nFor example, React abstracts DOM updates with its Virtual DOM, making it far better than manually updating the DOM with JavaScript or jQuery.\nQ: What do you do when you’re not coding? A:\nTrekking in the Himalayas 🏔️ (most of my vacations this year were for that). Hiking 🚶 Drawing 🎨 Q: Is your off-work routine completely separate from your work, or do you get “aha” moments? A: I don’t have a fixed routine, but I enjoy the things I do in my breaks.\nSometimes, I work on an interesting side project (involving code), and that feels like a good break, too.\nSo it’s a mix and match.\nQ: Developers are often stereotyped as geeks, but the best programmers often have creative/artistic sides. Do you agree? A: Absolutely! I see code as art.\nI recently started reading other people’s code, and it’s beautiful.\nCreativity isn’t just about UI or aesthetics—it’s also about how elegantly the code is written.\nQ: Your best piece of programming advice? A:\n💡 “It’s not rocket science. Someone else wrote it, so if you spend time on it, you’ll understand. Patience!”\n🙏 Thanks a lot, Aravind, for answering our questions! We can’t wait to see your next contributions to Bismuth! 🚀\nAbout Aravind Software developer specializing in JavaScript. Contributed to Bismuth’s client-side voting helper. Currently working on a modern client-side web wallet for Bismuth. 📢 Connect with Aravind Twitter: @aravindballa Website \u0026 Blog: aravindballa.com/writings ","references#References":" Bismuth Governance-Voting App Github - Governance-Voting "},"title":"BisBabble Interview - Aravind"},"/blog/2020-01-18-interview/":{"data":{"":"","-the-interview#📝 The Interview":" In this second issue of the “BisBabble” series we welcome Endogen, a long-time Bismuth supporter and developer of the Bismuth Telegram Bot, Bauer.\n📝 The Interview Q: Can you tell us a little about yourself? A: Sure! I’m a 38-year-old software engineer from Germany, but I’ve only been in the software industry for about 8 years.\nBefore that, I worked as a retail salesman for an electronics retailer, but I didn’t enjoy it—so I decided to study Software Engineering 🙂.\nAs a kid, I was naturally drawn to the internet and fascinated by software. Unlike everything else that seemed to decay over time, software stayed the same—I found that really interesting.\nToday, I work as a SAP consultant, helping companies implement SAP ME (Manufacturing Execution) to create paperless plants. Unfortunately, I no longer code at work, but I still love it and do it privately for fun.\nQ: How do you describe yourself at dinner parties? A: I don’t. I prefer to stay in the background and listen to people 😉.\nBut if I had to, I’d say I’m drawn to things outside the mainstream. Life is too short to be bored by mediocre stuff.\nFor example, I’ve always been fascinated by psychoactive drugs, consciousness, and philosophical theories.\nHowever, after having two kids, responsibility took over—but I’m sure I’m still strange as hell 😆.\nThat’s what I’d say at a dinner party. And the one or two people still cool with me after that? Those are the ones I’d have a beer with.\nQ: What made you want to start coding? A: I love the idea of creating something from nothing. Software is especially interesting because of its unique properties—once it exists, it can be used anywhere by anyone.\nThe fact that someone can write code, publish it on GitHub, and people worldwide can use it fascinates me.\nI believe proprietary software will become niche in the future—so everything I code privately will always be open source.\nQ: Is programming your day job or a hobby? A: It was my day job for a short time, but now it’s just a hobby.\nI’m not the best programmer, and I have other skills, but I love coding and do it in my free time.\nQ: How did you get introduced to blockchain? A: I first heard about Bitcoin while studying. I thought it was cool but didn’t look into it much.\nYears later, when I saw that these coins actually had value, I started digging deeper.\nI was fascinated by the decentralization, censorship resistance, and independence from traditional finance.\nIt was obvious—this is the start of a new paradigm.\nQ: What piece of code do you wish you had written? A: TensorFlow 😀\nQ: What code are you most proud of? A: Honestly? The Bismuth Telegram Bot.\nIt may sound silly, but it’s the first project where I really liked how the code was structured.\nAnd hey—I even got paid for coding in my free time! YAY! 🎉\nQ: What programming languages have you worked with? A:\nJava (for work) – liked it at first. Python (privately) – loved it. Since then, I never touched any other language. JavaScript \u0026 Vue – played around briefly, but nothing serious. Q: What led you to Bismuth? A: I love the crypto industry—it’s hilariously scammy, overblown, and overvalued. But on a serious note, it’s the future.\nNo one can stop it—it will drag the world with it, no matter what anyone tries to do.\nSince I’m also obsessed with Python, I looked for a Python-based blockchain.\nI didn’t want just a Python client—I wanted something I could tear apart and understand.\nThat’s how I found Bismuth. When I saw the logo and its connection to the chemical element, I was hooked.\nI love fractals, and Bismuth reminds me of that.\nQ: What’s your experience in the crypto field? A:\nFirst got into Bitcoin. Then found Monero (XMR)—loved the idea, but disliked C++. Got involved with Monero’s ecosystem (created a proposal for a Monero Marketplace Bot – 🔗 Proposal). With Bismuth, I could finally get into the code, which I loved. I also enjoy trading—not good at it, but for me, it’s a game \u0026 hobby. Q: What would you say is Bismuth’s biggest strength? A: It’s coded in Python.\nThat fact alone attracts a lot of competent developers.\nCombined with Bismuth’s features, it’s an exciting and fun project.\nQ: What would you say is Bismuth’s biggest weakness? A: The code itself.\nThe ideas behind Bismuth are brilliant, and HCLivess (Bismuth’s creator) is godlike.\nHowever, the code structure needs improvement.\nQ: Any thoughts on the current crypto industry? A: The next big thing? Mining isn’t the way forward.\nWe need nodes that directly validate and store transactions, receiving fees without intermediaries.\nIf your blockchain requires a second layer, then your first layer isn’t the future.\nAlso—Gossip protocols, WTF.\nQ: Most loved programming language, and why? A: Python! Python! Python! 🚀\nQ: Most hated programming language, and why? A: I can’t judge many languages, but between Python and Java—I find Java boring.\nAfter falling in love with Python, I never needed anything else.\nQ: What are you up to when you’re not coding? A:\nPlaying with my kids 👨‍👩‍👧‍👦 Thinking about obscure stuff 🤯 Gardening 🌱 Hanging out with friends 🍻 Downhill biking 🚴 (but no time for it anymore—kids come first!). I don’t take life too seriously and avoid most social activities.\nQ: Your best piece of programming advice? A:\n❌ Don’t read books about programming.\n✅ Just code.\n🙏 Thanks a lot, Endogen, for answering our questions! Keep up the great work! 🚀","references#References":" Github - Bismuth Telegram Bauer Bot "},"title":"BisBabble Interview - Endogen"},"/blog/2020-02-07-interview/":{"data":{"":"","#":" Welcome to another edition of BisBabble! In this episode, we chat with ShadowCrypto, a dedicated Bismuth supporter and key contributor to the Pawer bot.\nThe Interview Q: Hello Shadow! We heard about you in a previous BisBabble episode. You are a vibrant supporter of Bismuth and a much-appreciated code contributor to the Pawer bot. Can you tell us a little about yourself? A: I’m a programmer by profession and a photographer by passion, drawn to both shadows and crypto—hence my username (pun intended).\nQ: Since forums don’t allow for direct observation, how do you describe yourself at dinner parties? A: As an introvert, I prefer to stay silent and focus on the main purpose—eating, a lot!.\nQ: Well, introvert maybe, but you were the one who brought @aravindballa to the party—thanks for that! How did you get into programming in the first place? A: I have an interesting backstory for this.\nWhen I finished school and had to choose a field of study, I told my cousin, “Anything except computers.” A couple of years later, I ended up doing my undergraduate degree in Computer Science. I never regretted it—every day was fun!\nI first encountered coding through coursework and was fascinated by how a few lines of code could perform complex tasks.\nThat simple realization keeps me motivated to this day.\nQ: The preferred minimalism can be seen in your code. So, programming is your day job? A: Yes, I pay my bills with programming.\nQ: How did you get introduced to blockchain? A: Like many others—through Bitcoin.\nInitially, I was interested in crypto as an investment. At first, Bitcoin’s technical details were overwhelming. Over time, I took the time to understand it better. I still don’t know everything in detail, but I now have a decent high-level understanding. Q: What’s the piece of code you’re most proud of? A:\nBack when I was new to HTML \u0026 CSS, I worked on email templates.\nI migrated existing templates to plain HTML \u0026 CSS/SASS. Reduced 1700 lines of code to 450 per template. Supported all browsers \u0026 mail clients. There were 10 such templates in total! It was a great learning and implementation experience.\nQ: Minimalism again! What programming languages have you worked with? Python \u0026 Java (mostly). C/C++? Still unsure if I should count them—I started with them but didn’t continue afterward. Q: What led you to Bismuth? A: @cryptotyrion introduced me to Bismuth.\nThe fact that it was written in Python (my favorite language) made me dig deeper.\nQ: What’s your experience in the crypto field? A: I’ve been an investor/trader since 2017.\nQ: What would you say is Bismuth’s biggest strength? A: The devs.\nI’m amazed at how hard and smart they work, even in the toughest times.\nAlso, the community is incredibly welcoming.\nBismuth was my first open-source contribution.\nAt first, I had many fears about where to start, but the devs made it easy and were super helpful.\nIt’s a perfect learning environment for blockchain development—especially in Python.\nQ: Thanks! We try to be welcoming because we need contributors like you—and you’ve proved yourself! What would you say is Bismuth’s biggest weakness? A: The business model.\nI may be wrong or less informed, but I don’t fully understand how Bismuth generates money within its ecosystem.\nQ: You’ve mainly worked on the Pawer Discord bot. Are there other parts of Bismuth’s ecosystem you’d like to explore? A: Absolutely!\nI’d love to explore:\nZircoDice 🎲 Dragginator 🐉 Other DApps 🚀 I also want to build my own DApp.\nIf anyone has ideas and needs a partner, hit me up!\nQ: Most loved programming language \u0026 why? A: Python—as simple as writing a few statements in English.\nQ: Most hated programming language \u0026 why? A: I haven’t figured that out yet.\nQ: You’ll live longer if you only love and don’t hate—good call! On a more personal note, what are you up to when you’re not coding? A: I’m a photographer at heart—that’s what keeps me alive. 📷\nI love finding patterns, symmetry, and silhouettes in unexpected places.\nAlso, I won a national-level award and received a few other recognitions—making my parents proud at a young age.\nQ: Do you see any connections between photography and coding? A: Great question!\nFor me, programming is also an art form.\nPeople express creativity in different ways—programming is one of them. Photography and coding share similarities—composing a shot vs. composing a function,\nkeeping things minimal, finding patterns, and reusing them. Both give me the same dopamine hit—whether I capture a great photo or write a beautiful script.\nQ: Your best piece of programming advice? 💡 Programming is evolving fast—it takes just a few days to start learning a language (especially Python).\n💡 You can automate daily tasks or build fun projects—just for fun!\n💡 Not everything you learn has to make money—enjoy programming!\nThanks a lot, ShadowCrypto, for answering our questions! May the good vibes stay with you! 🚀\nMeet ShadowCrypto You can connect with ShadowCrypto on:\nBismuth Discord Twitter: @_shadow_crypto ","references#References":" Discord Twitter @_shadow_crypto "},"title":"BisBabble Interview - ShadowCrypto"},"/blog/2020-04-30-condition-monitoring/":{"data":{"":" Condition monitoring (CM) is the basis for condition based maintenance (CBM). CBM is an alternative to calendar based maintenance, where an asset is serviced in regular time intervals.\nCalendar based maintenance is easy to plan and schedule but it has some weaknesses:\nAssets which are in a good condition do not need to be regularly taken out of production for service, and\nan asset can still fail between regular calendar based maintenance events, causing downtime in production. CM and CBM are therefore used by many industries as an alternative to calendar based maintenance to strike a balance between maintenance costs and costs associated with unplanned downtime in production.\nOne example from everyday life is the annual service of your car. Since it is done on a regular basis without considering the actual condition of the car, this would be classified as calendar based maintenance. On the other hand, if you one day start to feel a small vibration in the steering wheel while driving and you take the car to service because of this observation, that would be classified as condition based maintenance.\nCM and CBM work well in a single organisation where traditional database tools (or data historians) are used to store and secure the data. This single organisation then owns the data and can control who has access. However, when more than one organisation or individual are involved, CM and CBM initiatives often fail because of the following issue: who owns the data and controls the server storing the data? Data and data analysis can have large potential value, and organisations and individuals are often reluctant to give this value away for free or lose control.\nHowever, data sharing among many participants can have large overall benefits for the group or society as a whole. A single asset does not normally operate in isolation, but forms part of a larger machinery or a plant. A condition which may be optimal for a single asset, may not be optimal for the overall machinery. By sharing data between participants, the performance of the overall machinery or industrial plant can be analyzed and optimized. Another example is the case where there are hundreds, thousands or millions of identical assets operating in the consumer industries. By sharing data, under-performing assets can be identified and corrective actions can be taken- benefiting society as a whole.\nIn the article “Blockchain world – Do you need a blockchain? This chart will tell you if the technology can solve your problem”, IEEE Spectrum, 2017, Morgan E. Peck presented the chart below.\nImage from: Morgan E. Peck, “Blockchain world – Do you need a blockchain? This chart will tell you if the technology can solve your problem“, IEEE Spectrum, 2017.\nThis chart illustrates that a public blockchain may be a good solution for problems where:\nMore than one participant needs to be able to submit and update data. The participants do not need to know and trust each other. The data does not need to be private. The database needs to be resistant to attacks or censorship. In this article it will be explained how the Bismuth public blockchain can be used to implement a system for distributed condition monitoring. For more information about Bismuth, see the whitepaper.\nBismuth is ideally suited to this type of applications, because it contains two fields in the transaction structure which are named “operation” and “datafield”. These two fields allow for building new meta protocols on top of the core blockchain software. In this article it will be demonstrated how a new meta protocol can be used in the development of a solution for decentralized condition monitoring.\nOne general problem with a decentralized public blockchain is spam. Any participant can submit any data to the chain and this can not be avoided. Instead of trying to prevent spam from occurring completely, a supplementary approach would be to filter out fake data. There are several ways spam protection and filtering can be achieved, for example:\nIntroducing fees to submit data. Anyone can still submit spam, but it will be expensive to do so. Introduce a meta protocol built on top of Bismuth’s operation and data fields to allow for filtering of fake data. The class BismuthSimpleAsset was written with this purpose, to provide tools for filtering of fake data. This class implements at the time of writing three operations in the meta protocol:\nmyapp:register myapp:unregister myapp:transfer The app name, in this example myapp, can be renamed to distinguish the implementation from other use-cases also using the same public blockchain.\nA physical asset often comes with a serial number or identification code printed on the asset itself somewhere. This number is in general not publicly available, but only known by the manufacturer initially, and later the customer. The manufacturer or the customer can use this identification number in Bismuth’s datafield, together with the operation myapp:register to link the serial number of the asset with his or her public/private key on the Bismuth blockchain.\nValid asset registrations in this myapp example can also be filtered with a minimum amount paid, to discourage spammers from randomly guessing and submitting asset id numbers. In addition to being a tool for filtering spam, a registration amount also gives the developer of the myapp use-case an income which can be used to maintain and further develop the service. Similarly, there could be an amount requirement also on the actual asset data submitted.\nOne decentralized system everyone is familiar with and where everyone is allowed to submit data, is the email system. Anyone can set up a new email server and start sending from it. One of the techniques used in filtering email spam is to use a PTR record. A pointer record, or PTR record, maps an IP address to a FQDN (fully qualified domain name). It is the counterpart to the A record and is used for reverse DNS lookup, which can help with blocking spammers. Many SMTP servers reject emails if no PTR record is found for the sending server.\nThe proposed approach presented in this article where an asset id number is linked to the public/private key on the blockchain to filter spam is similar to the reverse DNS method to filter email spam. The first user to link the asset’s identification number to his or her account, can be considered to be the rightful owner of the asset. This information can then later be used to filter out fake data about this asset submitted by other users. The following Python function in BismuthSimpleAsset returns the valid registrant given an asset id:\ndef get_registrant(self,asset_id): \"\"\"Returns the current registrant of a specified asset id\"\"\" regs = self.__get_reg_unreg_sorted(asset_id) registrant = self.__get_registrant_from_regs(regs) return registrant If the asset owner later wants to release his or her registration of the asset, this can be done by submitting the operation myapp:unregister together with the asset id in the datafield. Alternatively, the asset owner can transfer the ownership of the asset to another account by submitting the operation myapp:transfer together with the following in the datafield: asset_id,new address.\nAnother function in the BismuthSimpleAsset class- get_all_asset_ids() -returns all valid asset id numbers and associated Bismuth accounts. This function handles multiple register, unregister and transfer events of assets.\nWhenever a participant submits data to the public blockchain, the command myapp:data can for example be used, or something more specific, for example myapp:vibration_data. In the datafield a JSON string can be submitted, allowing for a flexible list of variables to be used. The asset id should be part of this JSON structure, to allow the filtering of fake data. Bismuth allows for a string of up to 100,000 characters in the datafield, so relatively large amount of data can be submitted. However, the transaction fee increases linearly with the data size.\nHaving a decentralized public blockchain with open data for everyone to access has potentially many benefits. Some of the benefits are:\nIt allows for independent 3rd party data analysts to offer services to the participants. This analysis can for example tell you about the performance of your asset, and what you can do to improve it. If someone registers a valid asset id and starts submitting fake data, this can potentially be detected by 3rd party data analysis. For example, some physical variables like the odometer value of a car can only increase over time. Invalid data based on more complex relationships between variables can potentially also be detected. The 3rd party service could then for example offer a whitelist and blacklist of asset id numbers, to allow for even more advanced data filtering. The owner of an asset can compare the performance of his or her asset with other peers, detect sub-optimal performance, and apply corrective actions. If the owner later wants to sell the asset to someone else, he or she can provide proof of asset performance during it’s lifetime to the new owner by using the publicly available data. By giving proof that the asset has been operated with care and within the specifications, the resale value of the asset may be higher than it otherwise would be. An increasing number of assets and consumer products are connected to the internet, and come with API interfaces which the owner or operator can use. Hence, the submission of data to the public blockchain can easily be automated or semi-automated for such assets. This article has given an introduction to some building blocks for decentralized condition monitoring using the Bismuth public blockchain. Several future applications and implementations using the principles laid out here are currently being worked on and will be published separately when ready.","references#References":" Blockchain World - Do you need a blockchain? Bismuth Whitepaper Github - Bismuth SimpleAsset "},"title":"Decentralized Condition Monitoring"},"/blog/2020-05-25-tesla-battery-monitoring/":{"data":{"":" Tesla is a market leader in electric vehicles (EVs). They have currently sold and delivered more than 1 million EVs worldwide while production is ramping up fast with new factories in Europe and China.","references#References":" Current Li-Ion Battery Technologies in Electric Vehicles and Opportunities for Advancements Benchmarks for New Battery Technologies BIS Exchanges Bismuth Discord ","tesla-battery-monitoring-on-blockchain#Tesla Battery Monitoring on Blockchain":"Although EVs in general require little maintenance, one expensive component in the car needs to be treated with care: the battery. This video explains what can happen if it is not. With Tesla EVs, there is an 8-year warranty on the battery. After this period of time, there is no longer a warranty, but a car is normally expected to last much longer than this. Although battery costs are declining over time, a replacement battery would typically cost $10,000 or more nowadays.\nSo, what can an owner do to maximize the lifetime of his or her EV battery? The CEO of Tesla – Elon Musk – has previously recommended to keep the battery level between 80% and 30%, see this tweet and the reply.\nThe table below illustrates that the lifetime of Li-Ion batteries is limited to a number of charging cycles. As seen from the table, smaller charging cycles consume proportionally less lifetime compared with full charges. The typical lifetime of a Li-Ion battery with 0-100% charge cycles is typically 450 cycles. With 10% charge cycles, on the other hand, the lifetime would typically be 10,000 cycles or more. So, a battery with 10% charging cycles will typically achieve a double lifetime compared to one which has done 0-100% cycles, for the same kWh energy consumption. It is clear from this observation that the charging behavior of the owner will significantly influence the condition of the battery, and hence the potential resale value of the vehicle.\nTable from the paper: Yu Miao et.al., “Current Li-Ion Battery Technologies in Electric Vehicles and Opportunities for Advancements”, https://doi.org/10.3390/en12061074\nWhen selling an EV on the second hand market, the remaining lifetime of the battery should be one of the most important questions. However, this question could be quite difficult to answer. If the battery condition is unknown, this could affect the resale value by giving the owner a lower price regardless of the actual condition. If, on the other hand the owner can prove, somehow, that the battery was treated with care and the expected amount of remaining lifetime is significant, the resale value of the vehicle should naturally be higher.\nOn the Tesla screen inside the vehicle and also on Tesla’s phone app, it is possible to view and inspect some battery parameters. However, these parameters are lost over time. There is a plot in the car which shows the efficiency (Wh/mi or Wh/km), but this plot is limited to the last few miles or kilometers. After a certain distance those values are lost for the owner.\nTesla has an (unofficial) API which allows 3rd party services to log data from owner’s cars. However, by using these services you have to either expose your Tesla login credentials or give an API token to these services. Many owners do not feel comfortable doing this, because it means the 3rd party service could potentially take control over your car, not just read data. Also, there is no guarantee that a 3rd party web service will continue to exist over the lifetime of your car. The average lifetime of an app or a web service is usually considerably shorter than a vehicle. If the operator of the service decides to discontinue – for whatever reason – your vehicle data may be lost. Even if you have a backup of the data, this may not be very useful if the user interface to display and analyze the data is no longer available. Another factor is the cost: most of the 3rd party services require you to pay a monthly fee to use their service to display and analyze your own historic data.\nThis is where blockchain technology enters the picture. The article “Decentralized Condition Monitoring” explains how a public blockchain can be a good solution when the following conditions are met:\nMore than one participant needs to be able to submit and update data. The participants do not need to know and trust each other. The data does not need to be private. The database needs to be resistant to attacks or censorship. For the above-mentioned reasons a solution for battery condition monitoring of Tesla EVs has been implemented by using the open source Bismuth public blockchain. Specifically, a Tesla plug-in (also called “crystal” in Bismuth terminology) has been developed for use together with the open source TornadoWallet. Some of the features of the implemented solution are:\nThe vehicle owner will not expose his or her login credentials to anyone, since the app runs on the local computer. All the code involved is open source and publicly available on GitHub on the official account of the Bismuth Foundation. Hence, anyone can verify that the software is safe to use and that there is no malicious intent. When the owner submits data from the vehicle to the public blockchain, he or she can decide to publish the vehicle’s identification number (VIN) openly, or to encrypt it with a password to remain anonymous. This should ideally be a strong password, and not identical to an existing one used for other apps or services. If the owner wants to sell the vehicle in the future, the password can be revealed to the new owner. The new owner can then verify that the submitted data actually belongs to the vehicle’s VIN. The first owner can transfer the virtual asset on the blockchain to the new owner, to allow the new owner to continue to submit data from the vehicle using his or her own account, while keeping the entire track record. To discourage spam and fake data, there are some costs (fees in BIS currency) involved when registering a new VIN on the chain and to submit data. If someone submits fake data to the chain, this would most likely be detected by other users, or by new data analysis services based on the publicly available data. For example, the odometer of a car can never decrease, or the amount of energy (kWh) added should, to some extent, match the battery level and distance driven parameters. To view and analyze the data is free for everyone. A public website has been set up for this purpose, to allow anyone to view and analyze the data without owning a Tesla vehicle or the need to run the TornadoWallet on their local computer. The public website has been developed to also work well with the Tesla in-car browser (Chromium). The screenshots below are taken from an actual vehicle, for both Night and Day mode.\nviewed in a Tesla vehicle (Night Mode). viewed in a Tesla vehicle (Day Mode).\nIf you have an Android phone it is also possible to run the Tesla plug-in locally by using Termux, see link. In this way, it is possible to submit vehicle data while on the road, for example just before and after charging your vehicle at a public supercharger station.\nThe screenshot below shows the data viewing and analysis section of the app. In this example, the vehicle IDs available for viewing have been encrypted with a password. Hence the actual VIN numbers of these cars are not available. The address on the right shows which Bismuth account has submitted the data.\nIn the menu above, a vehicle asset ID is selected as well as the start and end dates. After that, a number of parameters are available for viewing and analysis. One example plot is the “Estimated Max Range vs. Odometer” and the associated curve fit, see plot below.\nEstimated Range vs. Odometer and Curve Fit.\nThe green dots in this plot represent individual data points submitted by the owner to the blockchain. The parameter “Estimated Max Range” is based on data from the Tesla API, by dividing the estimated remaining range with the battery level. The curve fit is based on the data points matching the “Range Filter”. In this example only the 1% largest values are used to estimate the red curve. As can be seen from this plot, the estimated max range is falling, from about 485km to 480km. However, this plot does not necessarily represent the true battery condition, since a number of parameters may influence the estimate, such as ambient temperature, driving style, road conditions, etc. The way to get a more accurate measure of maximum range is to do a full charge (0-100%) and then check the EPA rated range (in North America) or Typical range (in Europe and Asia/Pacific), see link. However, you don’t want to do this exercise too often, as a 0-100% deep charging cycle is exactly what reduces the remaining lifetime of the battery the most.\nIf the owner submits data to the blockchain regularly, just before and after every charging event, it is instead possible to estimate the battery life without having to do deep charges. If all the charging events are recorded, Bismuth’s Tesla app allows for counting the cycles, using a method called rainflow counting, as illustrated in the screenshots below. The rainflow method is normally used in counting fatigue cycles in mechanical engineering, but it can also be used for counting battery cycles.\nCounted battery cycles and “Full Cycle Equivalent” during a selected time period.\nThe plot above shows that the owner has made several charging cycles at various levels from 10% up to 100%. By using the Li-Ion cycle life table from Miao et.al, these charging events are converted and summed up to a “Full Cycle Equivalent” of 6.03 during the time period selected (May 2020). Since the battery is expected to have a life time of about 450 full cycles, it can be estimated that 1.3% of the battery life was used up during this particular month. If this owner charges the equivalent of 6 full cycles every month, this battery can be expected to last about 77 months, or 6.5 years – significantly less than the normal expected lifetime of a car. Hence, by using the developed app, an owner can monitor the battery lifetime consumption of the vehicle on a daily, weekly or monthly basis, without performing harmful 0-100% deep charges.\nCurrently, there is talk about new batteries which will be capable of “a million miles” and a much higher number of charging cycles. In the paper by Harlow et.al, “A Wide Range of Testing Results on an Excellent Lithium-Ion Cell Chemistry to be used as Benchmarks for New Battery Technologies” (2019) batteries with NMC532 cathodes have been found capable of higher cycle life, of 5000 or more deep charges. However, it is currently being speculated that such batteries will be used in vehicles connected to the grid (V2G), which means that deep charges could potentially happen much more frequently, perhaps even on a daily basis (charge at night when power prices are low, and sell during the day when prices are high). In such scenarios it could be of even larger importance to record the charging cycles to document remaining lifetime and ensure as high a resale value of the vehicle as possible. If and when V2G becomes a reality, the Bismuth team will make available automated data to blockchain submission scripts to capture high-frequency charging events.\nWith Bismuth’s Tesla app, PDF files can also be generated for selected dates to document, for example, total distance driven during a given period or the sum of charge energy (kWh) added. In the example above, the sum of charge energy added is found to be 131.13kWh, since there are only three actual charging events (58.49, 51.18 and 21.46 kWh) in the submitted data. Such reports could for example follow the car when sold, as an alternative to giving away the password for the asset id on the blockchain.\nThe remaining two screenshots below are only available in the local app, and not on the public website. The first screenshot shows the asset registration screen. Here, the Tesla credentials are entered (username and password) as well as a (strong) anonymizer password if the user does not want to expose the actual VIN number. When the asset id has been registered, it will be linked to the Bismuth wallet address by paying a small fee. Only data for this asset id submitted from this account will be visible on the public website and in the plotting and analytics section of the app. If the owner later wants to transfer the vehicle to another owner, it must first be unregistered on the chain which allows the new owner to register it. By using the same password as the previous owner the original data set for the vehicle can be continued by the new owner. If a different password is used, then the asset id will be different and a new data set will be started from scratch. The Tesla credentials (username and password) will always stay on the local computer, and are never exposed to any external websites or services.\nBy entering the Tesla credentials and the anonymizer password (if any), battery data is collected from the vehicle. Once the data has been collected, it can be submitted to the Bismuth blockchain by paying a small fee.\nScreen for fetching battery data using the Tesla API.\nBismuth crypto currency is required to pay for fees and can be purchased on one of the BIS exchanges.\nHelp and support is given in our Discord There is a dedicated channel named #batterylife.\nFor those who are not able to run from the source code, updated binaries for Windows, Mac and Linux are available at our Github Repository."},"title":"Tesla Battery Monitoring"},"/blog/2021-01-01-toolbox/":{"data":{"":"","interview-with-whatever#Interview with Whatever":" Months ago, Bismuth user “Whatever” developed a shiny app to monitor his BIS mining rigs, wallets and Hypernodes. Apps you code for yourself, because you feel an urging need for it can end up most useful, and this one makes no exception.\nPreview of the Bismuth toolbox main screen\nAs a followup, Whatever also added more useful intel with hypernodes related data and monitoring The Hypernode monitoring section This app was already showcased in previous progress report:\nJune 15, 2020 progress report September 2020, progress report Interview with Whatever Very nice work and a much-needed app! So, we had to get in touch and ask him a few questions. 🙂\nGetting to Know You Q: Can you tell us a little about yourself?\nA: I’m an elder guy (\u003e25 y.o.) with a young soul (~25 y.o.), working a 9-to-5 job and enjoying hobbies like programming and cryptocurrencies.\nMy job isn’t in IT, and I’m not a professional coder—just an enthusiast. However, I do use programming at work (mainly MATLAB) for data modeling and process automation.\nQ: When did you first encounter computers and coding?\nA: I got my first PC in college—an Intel Celeron 100MHz, as I recall.\nMy programming journey started with Pascal and Basic (if you don’t know these, consider yourself lucky 😆).\nSadly, my career path didn’t require coding, so it remained a hobby.\nIntroduction to Blockchain \u0026 Bismuth Q: How did you first get introduced to blockchain?\nA: It was early 2017, just before the global crypto hype. ETH was around $10 at the time.\nI asked myself, “WTF is this Bitcoin everyone is talking about?” and started reading about blockchains, BTC, ETH, and mining.\nIt all seemed new and complicated—which made me dive in.\nI had some cash to burn, so I built my first GPU mining rig and started mining ETH. Later, I discovered BIS in late 2018.\nBIS was different—it wasn’t just “another shitcoin to mine.” I actually took the time to understand the project.\nWhat kept me around was the friendly and supportive community (shoutout to EggdraSyl, Evilpokerqueen, Raetch, and others).\nTech \u0026 Development Q: Is there a piece of code you wish you had written?\nA: I wish I had written Microsoft Windows—or, at the very least, I wish they would stop developing it (they have no idea what they’re doing 😆).\nQ: Any code you’re particularly proud of?\nA: None, honestly. I’m not a professional coder, and I’ve never been formally trained.\nIf anything, I’m ashamed of most of my code.\nHowever, I’m proud of the scientific solutions I’ve achieved using my ugly code.\nStrengths \u0026 Weaknesses of Bismuth Q: What do you think is Bismuth’s biggest strength?\nA: A talented dev team and an engaged, supportive community.\nQ: And its biggest weakness?\nA: Lack of marketing. It’s a result of limited resources—there aren’t enough people with the right expertise in the team or community.\nA great product isn’t enough; it needs to be marketed.\nThe dev team has done excellent work, but now it’s time to sell it. BIS has strong features that should be showcased.\nThe time has come to sketch out a real marketing campaign.\nProgramming Preferences Q: Your most loved programming language, and why?\nA: Hard to pick just one. If I had to choose two:\nPython (for general-purpose coding) MATLAB (for scientific computing) I’ve only written a handful of lines in Python, but I love its simplicity.\nQ: Most hated programming language, and why?\nA: Java. I do a lot of Android development in Java, and I hate it.\nToo much boilerplate code for simple tasks Null exceptions—hated by everyone I’m switching to Kotlin as soon as I finish my current project (Bismuth Toolbox).\nFinal Words \u0026 Reward Q: “Keep your friends close and your enemies closer” could be your dev motto? 😆\nA: Haha! Honestly, I’m not one to give programming advice—I should be the one receiving it.\nBismuth Toolbox has proven its value, and that’s all we needed!\nThank you for your support of Bismuth and your contributions to its ecosystem—much appreciated!\nReward Time 🎉 The Bismuth team is currently redefining its bounty system and priorities, but we always reward valuable community contributions.\nSince Bismuth Toolbox has been released as open-source (GitHub Repo), we are awarding Whatever a 10,000 $BIS reward for his work and dedication. 🎉","references#References":" Github - Bismuth Toolbox "},"title":"Bismuth Toolbox, interview and reward"},"/blog/2021-01-14-mobile-wallet/":{"data":{"":"","#":" For way too long, Bismuth had no proper mobile wallet, or was dependent on third party wallets. Those days are over!\nDownloading the Mobile Bismuth Wallet The Bismuth team is proud to announce that its brand new mobile Wallet, “My Bismuth Wallet” app is available on:\nGoogle Play (Android) IOS (Work in progress) Github (Source code) It was developed by our User RedDwarf as open source: awesome job!","references#References":" Github - My_Bismuth Wallet HD Paper Wallet ","wallet-walk-through#Wallet Walk-through":"Initial Setup 1. Hierarchical Deterministic Key Generation The new mobile My Bismuth Wallet is using the BIS HD standard for generating keys. The mobile Wallet lets you either create a new wallet (seed) or you can import a seed which you already have. Seeds and addresses are compatible with Angainor’s paper wallet. link\n2. QR Scan Option When importing the secret phrase you have the option to QR Scan the secret phrase (seed) or you can copy and paste the seed.\n3. Password Protected \u0026 Biotmetrics For security reasons you can define a password for opening the mobile wallet app. It is also possible to use biometrics instead.\n4. Backup Seed When you have created a completely new secret phrase (seed), double check that you backup your secret phrase in a non digital manner. This is the most important step to be able to recover the mobile wallet. No one else but you is able to recover your wallet.\nDo not use the sample secret shown here, since it’s public any fund will be robbed. This seed is also available later on, provided you remind the PIN you used.\n5. Wallet PIN Support Create and backup your wallet PIN to send Bismuth transactions.\n6. Send and Receive Transactions This is the standard My Bismuth Wallet view after creating a completely new wallet. Your first Bismuth address account has been created and you are all set for receiving Bismuth. The wheel icon on the top left lets you edit your Wallet settings. The cat avatar is auto-generated and is meant to easily identify your various addresses.\n7. Wallet Options After clicking the top left icon wheel button you are able to select and change different Wallet options.\nYou can change the base fiat currency, switch the Wallet language, change security settings (e.g. authentication method, wallet password), displays the Bismuth Token list, manage your contacts, backup your secret phrase and lastly you can logout which wipes your seed phrase.\n8. Easy Handling of Addresses To receive a Bismuth transaction you need to copy your Bismuth address and hand it to sender. You can do this by clicking on the Receive button and copying the Bismuth address or handing the sender the generated qr code address.\n9. Copy \u0026 Paste Functionality Sending a Bismuth transaction is very easy. You can either enter all the data by yourself or you can use the copy and paste functionality.\nThere is also another option to use the QR Code scanner to either scan a Bismuth address or you could also scan a QR Code BIS URL transmitting all necessary data.\n10. Transaction Confirmation View After you have successfully sent a transaction you see a confirmation view that the transaction has been sent.\n11. Transaction View List Once you have sent and received Bismuth you will see the transaction list on the main view. This particular view shows that you can not only send Bismuth but also Bismuth based Tokens. All transactions are listed in this view. If you want to see more information about a particular transaction, you can click on a transaction to see a detailed transaction view.\nNote: swiping a tx to the left will prefill a new transaction with same amount and recipient.\n12. Bismuth Native Tokens When you click on the middle bottom icon button from the main transaction view, the wallet will list all Bismuth native Tokens you own.\n13. Token List View To see a list of all available Bismuth Tokens ever created, you can click on settings and then choose the Token List link.\n14. Easy Access to Send Bismuth based Tokens You can send a Bismuth based Token from the normal send view, by sliding the “send a token” button to the right and then choose one of your available Token, add the amount and then send it.\nNote: Bismuth native tokens have no decimals."},"title":"My Bismuth Wallet - Mobile Wallet"},"/blog/2021-01-15-mobile-wallet/":{"data":{"":"","#":" For way too long, Bismuth had no proper mobile wallet.\nOne historical reason is that – despite being the fastest growing language – Python on mobile still is not mainstream. Sure, you can run a fully functional Tornado wallet on Android, but that’s not a 2 click install.\nThat’s certainly not an excuse however and the team saw the need for an easy to install and operate mobile wallet.\nThe chameleon episode Then, we paid an external team to integrate Bismuth as part of a multi-currency wallet. April 2019, Bismuth was available on the Chameleon wallet. A closed source multi currency wallet from Chainzilla. There was two benefits for Bismuth: – Instantly working wallet, from experienced team. No wasted time, no debug or support. – Chameleon user base. We certainly gained some exposure being present on that wallet, and our potential user base grew immediately.\nAlas, late 2020 Chainzilla announced they were stopping the wallet and would open source it. Despite numerous emails and tweets, to day the code is not available yet, and we got no answer from Chainzilla about the custom derivation scheme they used at start.\nWe were then in a worse position than ever… No more wallet, plus users stuck with a seed they couldn’t use anymore! Later on, we were able to recover one of the two derivation scheme, the older one still is missing.\nBehind the scenes work In the mean time, there was several aborted attempts to code our own wallet. This did not went through for lack of in house competences and time, but we had a few constraints in mind anyway, mainly with maintenance in mind:\nUse a known and future proof language and framework Aim for minimalist features first Ability to publish the wallet on app stores Cross platform Single code base if possible across platforms As close to native as possible We did some PWA – Progressive Web Apps experiments, looked at svelte.js, electron, and saw more and more mentions of Dart and Flutter. Flutter looked like a really great candidate, fulfilling all of our criterion. We began to search for Flutter experimented developers, and that’s when RedDwarf enters 🙂\nRedDwarf had some experience with a previous crypto mobile app with flutter, and was happy to offer his help. He ended up doing way more than that, since he fully developed the current “my Bismuth Wallet” app. The code is based upon Natrium Flutter wallet and is fully open source.\nEnd result and reward If we aimed for a minimalist app to start with, RedDwarf worked faster than we could test and we finally have a full featured wallet that also includes tokens management for instance.\nThe team was very pleased to work with him and the end result really is impressive. The Bismuth team happily awards a 20,000 BIS reward to RedDwarf and offers him free HN hosting if he needs.\nThe wallet is available on Google Play Android and the source code at Github.\niOS Version iOS Version is already working, thanks to Flutter and Dart, but Apple decided otherwise. Very recent policies change at Apple store made it so Crypto related app (namely, wallets) are subject to pretty restrictive conditions to be released. As a result the iOS version is not publicly available for the time being, but the team is working on a solution. We expect good news in the next weeks or months.","references#References":" Google Play Android Github - My Bismuth Wallet "},"title":"Bismuth Mobile Wallet - Genesis and Reward"},"/blog/2021-02-09-map/":{"data":{"":"","#":" We’re always happy to see new users jump in on the Bismuth Discord and ask questions. More over dev questions… And above all, we like it when these users then come back with a “Oh, by the way, I just did that small thing…”\nThe Hypernodes Map Here is what “Dingo” did: https://bismuth-map.herokuapp.com/.\nAnd best of all is Dingo released the application as Open-Source for anyone to run the the Bismuth Map.\nTimeline After Dingo announced his map, a tweet was sent out by a team member:\nOriginal Tweet\n… then after some quick exchanges Dingo updated the map with more information.\nThe latest version is out, now including financial metrics and USD value access. Additionally, a Youtube video about the application has also been released.\nReading between the lines One nice thing this map also shows is that while keeping an eye on the current trends and newest promising technology, Bismuth continues to grow its fundamentals.\nHave look at the upper left corner, with the core financial Hypernodes metrics in a snap:\nYes, the Bismuth Hypernodes still pay more than 17% yearly. Not for 1 month before vanishing, but every single week since they’re up, more than 16 months ago. This is sustainable, this is an in-deniable proof users keep faith in the project. More than 7 million BIS staked. More than 26% of the total supply. More than $820,000 locked. Awesome is it not?\nLow cap, yes. Low profile, certainly. No future? Great Scott! Far from it 😀\nReward A reward of 1000 $BIS will be sent to @Dingo as a thank you for his work.","references#References":" Github - Bismuth Node Map "},"title":"Real time Hypernodes map from Dingo"},"/blog/2021-02-24-bis-2.0/":{"data":{"":" Late last year, the Bismuth Foundation unveiled “Bismuth2.0”. The reveal was brief, did not go into any detail and the team remained silent on the topic for the following months.\nWe would like to thank everyone for their patience, the time has finally come for the big reveal! Let’s get right into it.","references#References":" Official Website Bismuth Explorer Crypto Exchange Coingecko Coinmarketcap Bismuth Blog ","the-basics#The Basics":"A Refreshed Look As some may have noticed, Bismuth partially “stealth rebranded” in late 2020 shortly after the Bismuth2.0 unveil. It was necessary to have a logo that was professional, but paid respect to the legacy artwork-themed logo for continuity. The new logo retains the same abstract and color scheme of the previous logo, while being much more minimalist and modern. Going into the Bismuth2.0 launch, this will be adopted as the official logo.\nBismuth2.0 Core Bismuth originated as a single-file code base. It grew to become a powerful engine after many thousands of updates \u0026 code iterations. With Bismuth2.0, it was time to consolidate, organize and clean up to get better control of the code, permit easier maintenance and streamline external work on the code. Regardless of the core overhaul, the new V2 code base will retain full compatibility with legacy nodes. Legacy support may be dropped at one point in the future once Bismuth2.0 has fully transitioned. Below is a summary of the core overhaul.\nCore code consolidated, organized and cleaned. Improved documentation for code, structures and custom architecture. Improved functional isolation with help of core modules. Easier to test with both unit tests on core modules as well as end-to-end test using the local regmode. Amounts are now stored under integer format instead of decimals, which allows for a smaller ledger, faster balance queries and no more complex rounding handling. Signatures and public keys are stored as binary instead of hex; meaning that less database space is required. Startup sequence fully reworked with “solo mode” on initiation. More sanity checks at startup. Reorganization and refactoring of code under logical units. The move to V2 core spreads across a whopping 246 commits, 142 changed files, 12,142 additions and 4,917 deletions.\nEasier on-boarding The Bismuth mobile wallet – more on that below – and growing support for native Bismuth tokens makes it way easier for everyone to use Bismuth and its little known features. As a result, it is also easier to build upon Bismuth, with more and more infrastructure and tools exposing undervalued use cases based upon native tokens or more evolved second layer protocols Bismuth supports thanks to its unique design.\nSticking with early goals, we aim to make Bismuth the platform of choice when it comes to learn, play, research and build practical applications with core blockchain concepts and Python.\nMarketing and communication Until then, we had hoped the technical documentation, code samples, proof of concept distributed apps (dApps) and monthly progress reports would provide enough matter for other developers and users to fully grasp what we were building, then translate that into more end user oriented content for anyone to understand.\nThis seems to be over-optimistic so the team will, in the future, provide more end-user oriented and practical short content to clearly convey the specifics of Bismuth and the powerful framework it has become. Existing, working, but under-the-radar apps and use cases will also be given some well deserved light.\nThe recent months also saw the emergence of several valuable contributions ranging from third party developers to just users learning. This proved how easy Bismuth is to work with. These contributions have been rewarded by the developers fund.\nIn order to trigger further similar contributions, more rewards are planned and a list of potential bounties with detailed specifications will be released over the next months.\nDecentralized Finance Decentralized Finance – “DeFi” – has been on the tip of everyone’s tongue over the past year. With a skyrocketing population of individuals growing tired of the world’s financial institutions, the democratization of finance is at its infancy- and the crypto industry is its nurturer. There have been many projects that have already taken the first steps in this space.\nWith Bismuth2.0, DeFi functionality built on top of Bismuth becomes a reality.\nAtomic Swaps Bismuth was a project written from scratch, and unfortunately was not born with the bells and whistles derived from forked protocols. One of such things is the atomic swap- which is a functionality that enables cross-chain swaps. This particular feature allows an individual to trade a coin from one chain against a coin on a different chain in an almost trustless manner. Bismuth had no simple mechanism to achieve this functionality- until now.\nA timelock mechanism – a crucial component for atomic swaps – is in the design phase, and will be tested and released once the V2 network is stable.\nWith this functionality, cross-chain atomic swaps become a reality.\nThe atomic swap feature can then also be used with Bismuth sidechains – see below – to further glue the main PoW chain and its derived PoS chains.\nContracts and Scripts One strength of Bismuth is its execution model and no need for a virtual machine (VM) in core nodes. Another under-looked feature is Bismuth native support for three different cryptographic schemes: RSA (with large key size) , ECDSA (like BTC or ETH) and the more modern ED25519. In addition to interesting cross-chain potential features, this also opens the door to all the core crypto gimmicks any of these schemes do support like scriptless scripts. Multisigs and threshold signatures for instance are natively supported with no need for any more processing in the node.\nCall for projects will be issued to make this usable in practice.\nWrapped Tokens Bismuth is not new to wrapped tokens. Very early in its history, it was available to trade on HEAT, one of the first DEXs. This was done thanks to a gateway wrapping native $BIS. Later came VITE and its ViteX exchange which listed BIS and there as well, $BIS is wrapped on another chain via a custom gateway.\nERC20: Ethereum-based decentralized exchanges have recently surged in popularity, with notable platforms such as Uniswap overtaking major CEXs over the past months. With billions of dollars in on-the-table liquidity, wrapped solutions have been created for currencies built on protocols separate from Ethereum. Currencies such as Bitcoin have had wrappers created (eg; RenBTC, wBTC) to help facilitate trade on ETH-based DEXs. A first proof of concept of BIS \u003c\u003e wBIS bridge was run for a limited time by a third party.\nThe Bismuth Foundation will create and support an official ERC20 Bismuth wrapper to tap into the enormous and growing liquidity available on Uniswap and other Ethereum-based decentralized exchanges. This will also help Bismuth potentially gain exposure from the tens of thousands of speculators that utilize DEXs on a day-to-day basis.\nOracles Oracles are a tool that permit dApps and smart contracts to access off-chain data. In all circumstances, blockchains are isolated and have a very limited exposure to off-chain data. For more complex applications, it is crucial to access data points that would traditionally not be available on-chain; such as pricing data aggregated from an exchange.\nOngoing research and specifications- such as EggPool’s “Link Of Trust” will allow Bismuth to support Oracles in a very novel manner, making use of the “Freedom of Interpretation” concept. In addition to Oracles, Link of Trust also addresses concerns such as pseudonymous digital identity, reputation, and pseudo uniqueness. More information on Bismuth Oracles will be published once V2 is stable.\nDecentralized Exchange The ERC20 Bismuth wrapper will allow Bismuth to be traded on existing ETH-based DEXs, however with improvements to the plugins protocol, second-layer solutions, and a specific sidechain, Bismuth could also operate its own decentralized exchange with rapid blocktimes, support several blockchains through Bismuth Tokens (bBTC, bETH), and facilitate trade through native liquidity pools or bonding curves.\nSidechains Sidechains are an extremely novel utility in which network layers can work in tandem but are not limited by one another. A sidechain has existed on Bismuth since 2019, known as the Hypernode Network. This first born sidechain acts as the PoS layer for the Bismuth protocol – embedding network metrics within transactions, which in result are used to compute the weekly Hypernodes rewards. The current Hypernode implementation is in need for pruning as well, which is planned later into the Bismuth2.0 release. As well as a lighter footprint on hardware, the next iteration of Hypernodes will feature further stability, less disk space usage, and far less resource usage.\nAs the Bismuth team envisions them, side chains are the definitive answer to scalability, because they allow application level sharding. As you can see what’s happening with ETH, the most prominent use case of a chain becomes so prevalent it either leads to congestion or insane fees. As a result, lesser valuated apps can no longer be used because the fees are then higher than the provided service’s perceived value. This effectively kills any other dApp running on the platform.\nWith a Bismuth side chain, every application or class of application can run on its own side chain. Loosely coupled to the main PoW chain, and totally independent of the other side chains. Every side chain can have its own transaction format, its own block times, pruning limit and parameters, its own use case and fees structure – if any. Every chain runs independently, no matter the potential congestion of its cousin.\nOn the topic of sidechains, the possibilities are limitless when it comes to parallel utilities built on top of the Bismuth protocol. Sidechains permit Bismuth to be virtually infinitely scalable, with the sole limiting factor being available compute resources. Individuals and enterprises alike can build on top of Bismuth while being unbound by the existing constraints of the Bismuth PoW chain through the use of sidechains. The Bismuth Foundation has planned the following sidechains to be constructed on top of the Bismuth protocol:\nData archiving side chain IOT \u0026 MQTT sidechain Dedicated FT/NFT sidechain Metadata storage sidechain More sidechains are also envisioned:\nDedicated DEX sidechain, with rapid execution, fast block intervals, and data pruning Dedicated Oracles sidechain Side chains are an essential ingredient to the future Bismuth platform growth. They bring the flexibility to build blockchain powered applications with little effort, capitalizing on Bismuth’s experience, existing infrastructure, and toolset.\nPlatform Expansion Bismuth is a from-scratch Python protocol that did not fork code from existing protocols. Therefore when it comes to having mobile and hardware applications, those would have to be built from the ground up to facilitate Bismuth’s architecture. For the Bismuth2.0 release, we have some exciting news in this area.\nMobile Applications There used to be a mobile wallet for Bismuth, developed by Chainzilla- known as the Chameleon wallet. Unfortunately, support was dropped by the original developers and no longer was a viable option. A brand new, open-source and custom built mobile wallet is now available. This wallet is “one-click” install on Android and coming to iOS, which is huge in regards to on-boarding non-tech savvy individuals. You can refer to the related article there.\nThe Bismuth mobile wallet has integrated support for native tokens, and is dApp ready: it comes with BisUrl support – a way to convey all data about a transaction into a reliable format, as well as “operation” and “data” support, making the mobile wallet an universal tool to interact with any second layer protocol.\nHardware Devices A third-party development team is currently working on a hardware wallet device. The design of this wallet addresses most of the issues other hardware wallets face, including price, privacy and plausible deniability. This device will support signing of BIS transactions but also paves the way to more use cases, like sign-in and secure off-chain authentication. We are extremely pleased to announce that this will be cheap, open-source, and based on largely available hardware and Python code. Integration with Ledger devices is also in the research stage.\nClosing Thoughts Bismuth has been in constant, non-stop development by the Bismuth Foundation – a team of dedicated individuals that have gone above and beyond the call of duty to maintain and upgrade Bismuth until this day. This effort has never wavered – the team is as active as ever, with huge things happening behind the scenes. Bismuth’s custom code base and architecture means that adoption and integration is not as immediate as most tokens and forks. However this in a way is not an obstacle – Bismuth does not have the limitations of most cryptocurrencies that are constructed on existing architecture fathered by Bitcoin or Ethereum.\nProgress is being made- and with great speed. Until recently Bismuth native tokens were a little known feature of the legacy wallet, with little documentation nor use. Only just recently have we seen massive changes in this area:\nFull token support on the browser-based Tornado wallet. Dedicated tokens explorer. Tokens support on Discord, via the Discord Pawer bot. Mobile wallet, with full tokens and generic protocol support. Native Bismuth tokens are now as easy to use as the core Bismuth coin, and usage can now be much more widespread for end-user cases. Much more use-cases for tokens will come to life over the coming months.\nUnaffected by the ever changing hype and meaningless trends that come and go, the Bismuth team kept its focus on strengthening the core and basic building blocks of a wide ecosystem, with real and practical use cases as the end goal.\nWe have had applications built on top of Bismuth, such as the Bismuth Tesla EV battery life dApp, and Phone battery monitor. With Elon Musk’s recent and loud entry into the crypto industry, we are hoping to capitalize on the momentum and help give these tech-oriented dApps some much-needed exposure. The use-cases are limitless when it comes to utilitarian development on top of Bismuth. This is further compounded by the fact that all code can be written in the world’s most popular and fastest growing programming language, Python.\nA global overview of the Bismuth 2.0 Roadmap will be released in the next weeks and will be followed by detailed insights of the various sections.\nThe crypto industry is moving at a rapid pace, and the upcoming 2.0 launch will enable Bismuth to capitalize on this. It is now easier for the core development team to add new functions and features on a stable codebase, extend the building blocks and support practical, real world use-cases.\nWe would like to thank the loyal Bismuth community for their support over the years."},"title":"Bismuth 2.0 - Official Announcement"},"/blog/2021-03-24-state-machines/":{"data":{"":"","#":" Are you familiar with Finite state machines? They are everywhere, yet, we don’t see them as such.\nState machines A state machine – in mathematical terms – is a model of computation. It is defined by a – finite – list of states, including an initial state as well as transitions: conditions that have it move from one state to another one. This seems very simple, and it can be. Here is a sample machine from Wikipedia.\nA simple state machine: a door that can only be closed or open. Don’t be fooled by the apparent simplicity of this sample: state machine can be very, very complex… but also very useful.\nHere’s why: The most known computation model is the Turing machine. Most computer hardware and programming languages rely on this model. This is a very open model, that allows to do many things. This is also a weakness, because you can’t always predict what states such a model will end up in.\nThis has several implications. With classical programming, you can end up with an edge case where your program will run forever – be it because of the algorithm, or an implementation bug – or end up in an unplanned state, where it will be stuck and never recover.\nThis is one of the flaws of the ETH VM for instance, which is Turing complete. Its capacity to run loops means it can be stuck inside a large or infinite loop and consume a huge amount of gas. Other smart contract languages willingly chose to have a non Turing complete language to avoid unexpected side effects.\nThe same happens with complex virtual objects like a client or server for a given protocol. Say, a custom protocol over a raw socket, or at a higher level, a blockchain node.\nWhen designing such an object, interacting with others, you often – consciously or not – think of it as a state machine. The node is “starting”, it’s “syncing” or “digesting a transaction” or “waiting for next block” aso… When you implement this with “regular” code, events, functions, methods, private or global variables… you are not bound by a state machine computation model. You are Turing complete. The compiler lets you write dangerous things you are not aware of, that can backfire: your system can end up in a totally unstable and unplanned state, with no way back to a functioning mode.\nThe limits of the state machine model then become a strength: If you model your object as a state machine and take care of all the needed states and transitions, you are sure (to the extend of your trust in the state machine framework you use) your system is only in one of the planned states.\nIt could end up stuck in a given state with no way out, because you forgot a transition, but it will never magically jump from one state to another with no reason.\nWorking with state machine is then more stringent: you have to define all possible states and conditions, instead of just the obvious paths. But these added constraints also force you to fully define your model, and allow to reason on a global scale, with an overview you can rely on.\nState machines and Python Any Turing complete language can implement state machines, since state machines are a subset of the Turing model.\nYou can code state machine behavior with vanilla code. Have a class, with a private member representing state, and methods as transitions for instance. This is enough for simple things.\nIf you want to go further, nice libraries and tools have been coded.\nAs for Python, I picked two of them:\nPytransition Pytransition is an actively maintained and very complete state machine framework, with several extensions.\nThe github comes with a full documentation, the quickstart being a funny “narcoleptic super hero” example\nQuickstart from Pytransitions Note the diagram is generated from a “diagram” extension, by the module itself.\nThere is even more since a GUI, running with a Tornado web server and JS client code, allows to draw and manipulate the models. It’s not only fun but pretty useful!\nState machine GUI editor\nMany examples come with the library. Best thing you can do is bookmark the Github and use it for your next project or rewrite, then come and tell us! Github\nPysm This library is older and simpler, and it’s also why it was selected.\nAnother big up is its MicroPython support. With embedded python coming everywhere, it would be a shame not begin able to use that state pattern there as well.\nStill, Pysm is a complete library, with all you’ll need including transition callbacks, and state hooks, conditional transitions… while remaining lightweight and fast. It comes with documentation, test and examples. Github\nHere is a sample of a complex hierarchical state machine designed with Pysm (taken from pysm github)\nWhen to use state machines? Some use cases are obvious: when the logic is that of an “automaton”, like a vending machine, a “stubborn” and predictable machine that does only a handful of things in the right order, it’s quite easy. In that case, state machine should be a no brainer.\nSome cases are more difficult to grasp at first sight, but they may be where you have the most to gain. Take a socket reading for example, with some custom protocol, or a parser for a specific syntax. Here, consider the logic as a state machine can alleviate the code a lot, make it clearer, and easier to explain. Added bonus: you’re more confident you did not forgot edge cases (unit test still are required, don’t get me wrong)\nLast case is for more complex systems, like a whole blockchain node for instance. As simple as it looks, it’s not at all, and converting legacy code to a state machine can be a huge work. This could even force you to rethink your protocol… One thing is sure: the sooner you consider your system as a state machine, the better you’ll have a practical overview you can spec, discuss, and work with.\nSome external pointers Finite state machine article on Wikipedia PyTransitions Github and its GUI Github Pysm – with Micropython support Github Your turn! It’s up to you!\nDid you already work with state machines?\nDid this post motivate you to give it a try?\nDo you have a good example in mind that could benefit from this model?\nPlease tell us, we’re eager to know!\nYou can join us on Twitter @bismuthPlatform or on our Bismuth Discord.","references#References":" Github - Pyrtransitions Github - Prysm Wikipedia - Finite State Machine Github - Transitions GUI "},"title":"Python and State Machines"},"/blog/2021-04-21-eth-bridge/":{"data":{"":"\nTo swap between native BIS and ETH wBIS token, you need the newest Tornado wallet (v0.1.41 or more) with the EthBridge Crystal activated, as pictured above.\nTornado Bismuth Wallet releases\nAnother version of this help, with more detailed info, can be found on our Github Bismuth FAQ.","add-liquidity#Add liquidity":"Once you have wBIS on ETH, you can provide liquidity by binding both $wBIS and $ETH to a liquidity pool. wBIS/ETH Pool.\nThe more volume in the pool, the less the volatility and the more it can be noticed by ETH traders. Everyone is encouraged to contribute to the liquidity pool to support Bismuth. If you’re new to ETH and Uniswap, make sure you read about impermanent loss so you know what you’re doing and what the potential risks are.","bis-to-wbis#BIS to wBIS":"Send native BIS to the bridge, get wBIS on ETH (same amount less 5 BIS fees)\nPick “BIS-\u003eWBIS 1/2” menu – also available from “swaps” page Fill in ETH recipient and amount double check your ETH address, no going back Send the BIS Go to “Swaps” page wait for the BIS confirmations, then for the mint to be signed. This can take a while depending on the timing and availability of the signers. Just be patient. If your transaction is confirmed on the BIS chain, it will eventually go through. Use the “proxy mint” link to mint your wBIS (auto filled parameters) Your ETH wBIS balance is updated Detailed step by step guide with screenshots on Github","farm-wbis-on-unicrypt#Farm wBIS on Unicrypt":"The Unicrypt farm will operate from April 28 2021, you can already stake there. Please check the wBIS farming guide.\nStaking on the farm will provide temporary rewards as wBIS.\nNote: Nothing in this post is to be considered as financial advice!","references#References":" Tornado Wallet Github Bismuth FAQ wBIS on etherscan BIS Bridge on Bismuth Explorer Oracle on Bismuth Explorer Step by Step Guide wBIS/ETH Pool wBIS farming guide ","the-wbis-token#The wBIS Token":"wBIS is an ERC-20 ETH Token with 1:1 native BIS counterpart.\nChain: ETH Mainnet Contract address: 0xf5cB350b40726B5BcF170d12e162B6193b291B41 View wBIS on etherscan Name: Wrapped BIS Decimals: 8 (same as native BIS) Custom logo: https://raw.githubusercontent.com/bismuthfoundation/MEDIA-KIT/master/Logo_v2/wbis500x500.png The Eth bridge crystal comes with a one-click button to set up the correct custom token on your metamask extension.\nThe Bridge is decentralized and runs thanks to a custom BIS protocol. It relies on Both a bridge and an oracle.\nBIS Bridge Address: Bis1UBRiDGEQc9mBywXpwFZX6LF7hN4i8Qy9m Bridge explorer link BIS Oracle Address: Bis1XETHbisxnShtghYQJDbf8o5gsQczW8Gp2 Oracle explorer link ","video-walkthrough#Video walkthrough":" Thanks Damian for the video!","wbis-to-bis#wBIS to BIS":"Burn wBIS on ETH, get native BIS on BIS chain (same amount less 5 BIS fees)\nPick “wBIS-\u003eBIS” menu – also available from “swaps” page Fill in BIS recipient and amount double check your BIS address, no going back Check and adjust gas price Burn the wBIS Wait for the ETH confs, then for the oracle and delivery to be signed. This can take a while depending on the timing and availability of the signers. Just be patient. If your transaction is confirmed on the ETH chain, it will eventually go through. You can go to “Swaps” page to monitor the progress Your BIS balance is updated "},"title":"Using the BIS\u003c\u003eETH Bridge Crystal"},"/blog/2021-05-12-bsc-bridge/":{"data":{"":"","#":"\nTo swap between native BIS and BNB wBIS token, you need the newest Tornado wallet (v0.1.43 or more) with the BscBridge Crystal activated, as pictured above.\nTornado Bismuth Wallet releases\nAnother version of this help, with more detailed info, can be found on our Github Bismuth FAQ.\nThe wBIS Token wBIS is a BEP-20 BSC Token with 1:1 native BIS counterpart.\nChain: BSC Smart Chain Contract address: 0x56672ecb506301b1E32ED28552797037c54D36A9 View on bscscan Name: Wrapped BIS Decimals: 8 (same as native BIS) Custom logo: https://raw.githubusercontent.com/bismuthfoundation/MEDIA-KIT/master/Logo_v2/wbis500x500.png The Bsc bridge crystal comes with a one-click button to set up the correct custom token on your metamask extension.\nThe Bridge is decentralized and runs thanks to a custom BIS protocol. It relies on Both a bridge and an oracle.\nBIS Bridge Address: Bis1FWBNBbrYZkQmCYQf8FQWTUCFEreUeT71\nBridge Explorer Link\nBIS Oracle Address: Bis1XBNBY66wngPLVwbRbnSs4ScVBwE3iM7kL\nOracle Explorer Link\nAdd BSC network to Metamask Open Metamask and click on ‘My Accounts‘ \u003e ‘Settings‘ \u003e ‘Networks‘ \u003e ‘Add Network‘ Fill in the following data for the BSC Mainnet.\n– Network Name: BSC Smart Chain\n– New RPC URL: https://bsc-dataseed.binance.org/\n– ChainID: 56\n– Symbol: BNB\n– Block Explorer URL: https://bscscan.com\nDetailed screenshots on Github\nBIS to wBIS Send native BIS to the bridge, get wBIS on BSC (same amount less 5 BIS fees)\nPick “BIS-\u003eWBIS 1/2” menu – also available from “swaps” page Fill in BSC recipient and amount double check your BSC address, no going back Send the BIS Go to “Swaps” page wait for the BIS confirmations, then for the mint to be signed. This can take a while depending on the timing and availability of the signers. Just be patient. If your transaction is confirmed on the BIS chain, it will eventually go through. Use the “proxy mint” link to mint your wBIS (auto filled parameters) Your BNB wBIS balance is updated Detailed step by step guide with screenshots on Github\nwBIS to BIS Burn wBIS on BSC Smart Chain, get native BIS on BIS chain (same amount less 5 BIS fees)\nPick “wBIS-\u003eBIS” menu – also available from “swaps” page Fill in BIS recipient and amount double check your BIS address, no going back Check and adjust gas price Burn the wBIS Wait for the BSC confs, then for the oracle and delivery to be signed. This can take a while depending on the timing and availability of the signers. Just be patient. If your transaction is confirmed on the BSC Smart Chain, it will eventually go through. You can go to “Swaps” page to monitor the progress Your BIS balance is updated Add liquidity Once you have wBIS on BSC, you can provide liquidity by binding both $wBIS and $BNB to a liquidity pool. wBIS/BSC Pool\nThe more volume in the pool, the less the volatility and the more it can be noticed by BNB traders. Everyone is encouraged to contribute to the liquidity pool to support Bismuth. If you’re new to BNB and Pancakeswap, make sure you read about impermanent loss so you know what you’re doing and what the potential risks are.\nFarm wBIS on Pancakeswap The Pancakeswap farm is WIP, an update will follow. Please check the wBIS farming guide.\nStaking on the farm will provide rewards as wBIS.\nNote: Nothing in this post is to be considered as financial advice","references#References":" Tornado Wallet Github Bismuth FAQ wBIS on bscscan BIS Bridge on Bismuth Explorer Oracle on Bismuth Explorer Step by step Guide Add Liquidity wBIS farming guide "},"title":"Using the BIS\u003c\u003eBSC Bridge Crystal"},"/docs/":{"data":{"":"","#":"Introduction Welcome to BISMUTH!\nYour all-in-one python blockchain platform is here! This guide will help you set up, explore, and play with BISMUTH for seamless on-chain exploration.","bismuth-information#Bismuth Information":" mainnet launched on May 1, 2017 custom sha224 mining algo heavy3 - optimized for GPU mining 60 seconds block time mining difficulty retargets every block mining rewards reduce slightly every block (instead of a Bitcoin halving every four years) lightweight Mainnet Node fair distribution - no ICO, no premining supports multiple address formats (ECDSA, RSA, ED25519) simplicity - transaction id is derived from signature (unlike eth, a nonce for preventing replay attacks isn’t needed) extensibility, mainnet apps can be optionally added via plugins modular like building blocks system ","references#References":" Github Bismuth Mainnet "},"title":"Documentation"},"/docs/getting-started/":{"data":{"":"This guide will help you quickly get started with BISMUTH as a regular user, as a developer or as an exchange planning on implementing a $BIS trading pair.","developer-guideline#Developer Guideline":" Read the Whitepaper Install the Bismuth Mainnet Node Study the Tornado Wallet Apps to learn how to extend the Mainnet node Take a look at all Bismuth based applications Read the Bismuth FAQs Bismuth Native API command reference Client API Command List Hack-with-BIS Awesome-Bismuth Bismuth Explorer API ","exchange-guideline#Exchange Guideline":" Bismuth Implementation Guide Install Mainnet Node ","user-guideline#User Guideline":" Start with a Bismuth Wallet Get familiar with the different available address schemes (rsa, ecdsa, …) Get some $BIS from an exchange or ask on the discord server for a faucet Do low value test transactions to learn sending/ receiving $BIS Check your transaction on the Bismuth Explorer Confirmations before respending: 1 "},"title":"Getting Started"},"/docs/mainnet/":{"data":{"":"","bismuth-mainnet-info#Bismuth Mainnet Info":"Bismuth Mainnet Info Bismuth is the only project in the world that has implemented the alternative approach to smart contracts as suggested by Nick Szabo. Thanks to the down-to-earth implementation of contracts, Bismuth does not require a separate oracle system. Every node is an oracle by default. Bismuth is the only project in the world that supports multiple cryptosystems for signatures, making it effectively resistant to quantum attack towards any single system. Bismuth blockchain pruning exists since 2017 and reduces blockchain size to 100 MB at any given point. Bismuth is the first blockchain platform fully created in Python. There is a unique system at the core of Bismuth mining, it utilizes bit matching for block hash linking. Bismuth now has many core developers, most of them are pool owners. PoW works for adoption. Bismuth mainnet launched in 2017, but has been in development since 2014. The transaction, network, consensus layers, the wallet, the original explorer and several dapps have all been written by a single person. The main problem of Ethereum is ignoring that transactions that do not involve value transfers do not need consequential order / Nakamoto consensus. ETH scaling is therefore limited to it’s serialization design. Bismuth is not. Bismuth contracts are independent of the core layer. Nothing on Bismuth interferes with the consensus layer. Bismuth plugins enable you to create applications that do not rely on blockchain speed (off-chain) but can still fully utilize all advantages of it. Hypernodes run on their own PoS system. Bismuth rewards drop with every single block. Bismuth is the only cryptocurrency project in the world that supports multiple address formats (ECDSA, RSA,…) Bismuth’s casino Zircodice was created after failed promises of the XVC developer “John Connor” mysteriously disappeared and abandoned the project. Bismuth has an automated giveaway bot for Twitter which rewards users for tweeting about it. Python is the most attractive and effective language of them all. Bismuth combines voluntarism with decentralization to secure unlimited scaling. It works because users are given a choice, not being dictated which plugin, dapp or crystal to use. Consistency is required only on the most elemental level. Bismuth allows for on-chain forking on the secondary level without any impact on it. One of the ultimate goals of Bismuth is to become the blockchain enabler. Not to force anything on users or their nodes to limit scalability, but to let them use the parts of the ecosystem which they opt for. To create an elemental mosaic. Total decentralization. With Ethereum, every computer is a copy of other computers. With Bismuth, every computer is an independent server with optional integrations. ","references#References":" Github Bismuth Mainnet "},"title":"Mainnet"},"/docs/mainnet/exchanges/":{"data":{"":"","bismuth-exchange-implementation-guide#Bismuth Exchange Implementation Guide":"Bismuth Exchange Implementation Guide Explore our comprehensive Bismuth Exchange Implementation Guide for detailed, step-by-step instructions on integrating Bismuth into your exchange platform. This guide walks you through setting up your development environment, configuring API connections, signing transactions, and implementing robust security practices.\nDesigned to help you smoothly navigate common integration challenges, the guide includes practical examples, best practices, and troubleshooting tips.\nActive Centralized Exchanges Implementing Bismuth Xeggex Finexbox Former or Inactive Exchanges That Listed Bismuth qTrade Exchange Hubi Graviex Top BTC ViteX Cryptopia HEAT ","references#References":" Bismuth Implementation Guide "},"title":"Exchanges"},"/docs/mainnet/install-node/":{"data":{"":"","how-to-run-a-mainnet-node#How to Run a Mainnet Node":"How to Run a Mainnet Node This guide provides several methods to set up and run a Mainnet Node. Choose the approach that best fits your needs.\nAutomatic Installation For a quick setup, use our Auto Install Script, which also installs the sidechain Hypernode.\nManual Installation Prefer a hands-on approach? Follow our Manual Installation Guide for step-by-step instructions.\nDocker Deployment Deploy a containerized node easily with our Bismuth Docker Image.\nDatabase Snapshots Download Snapshot: Use the Snapshot Guideline to obtain an existing database snapshot. Create Snapshot: Generate a backup with the Bismuth Snapshot Script. ","references#References":" Auto Install Script Manual Installation Guide Bismuth Docker Image Snapshot Guideline Bismuth Snapshot Script "},"title":"Install Node"},"/docs/mainnet/mining/":{"data":{"":"","bismuth-mining#Bismuth Mining":"Bismuth Mining Bismuth Heavy3 Mining Algorithm On October 8, 2018 - block height 854,660 - the new and novel Heavy3 mining algorithm was introduced on the Bismuth Mainnet.\nProperties\ncustom sha224 tailored for GPU miners more resistant to FPGAs and ASICs miners The idea behind the “Heavy3” algorithm designed by EggdraSyl is both simple and effective: It requires a read from a random offset in a fixed lookup table, for each tested nonce.\nThis concept can be applied to any other mining algorithm as an additional layer to protect against a similar attack. If the matching algorithm uses hashcash or not - bismuth does not - is irrelevant. The final hash state that is tested is a vector of 32 bits words. Since it is a hash result, it can be considered as a random vector, it can contain anything, and you can not reverse the process – this is a hash core property – The lookup table also contains random data. For each nonce, the extra step is applying a XOR transform to the hash output, given a random vector from the lookup table, with the index begin determined by the hash itself, therefore at a random, non predictable, location. The result – xor’d hash state – is considered as the input vector to the difficulty matching function.\nOpen-Source Miner \u0026 Pool kbkminer - kbkminer is a GPU CUDA Miner for Bismuth. Optipoolware - Optipoolware is a Mining Pool application which supports kbkminer. Legacy Mining Pools That Have Ceased Operations Significant old legacy pools, listed by alphabetical order.\nBis-pool.net Bismuth.Coinsaurus.com EggPool.net Noncepool.com Blocks Distribution Chart Miningpoolstats ","references#References":" Bismuth Whitepaper kbkminer Optipoolware Miningpoolstats "},"title":"Mining"},"/docs/mainnet/overview/":{"data":{"":"","bismuth-technical-overview#Bismuth Technical Overview":"Bismuth Technical Overview Bismuth, an account-based model, doesn’t require a unique identifier (like a nonce) to prevent replay attacks as Ethereum does. Instead, it uses its unique transaction signature for identification.\nHow the Unique Signature Method Works Intrinsic Uniqueness: In Bismuth, every transaction is signed in such a way that the resulting signature is unique. This signature then becomes also the transaction’s identity.\nReplay Prevention: Since a valid transaction is uniquely identified by its signature, if someone tries to replay the same transaction, the system can detect that the signature (and thus the transaction ID) has already been used and reject the duplicate.\nSystem: Proof-of-Work (custom implementation) + HyperNodes (custom implementation) Hashing algorithm: SHA224 Mining algorithm: Heavy3 Signing algorithm: PKCS1_v1_5 Block time interval: 60 seconds Transaction size: ~650 bytes + data fees Mining reward: Tapering from 15 at block 1 to 0 at block 7,100,000 Difficulty: Proportional–integral–derivative controller Difficulty retarget: Every block Total PoW reward: 51,370,000 (plus 10% dev rewards) PoS reward (HyperNodes): 0.8 per block from block 800,000 to 1,200,000 PoS reward (HyperNodes): 2.4 per block indefinitely from block 1,200,000 Smallest unit: 0.00000001 Confirmations before respending: 1 Plain text peer list file Tor proxy support Optimized towards efficiency Dual database system for maximum performance Database compression/pruning Arbitrary data storage ecosystem and philosophy Address-based anonymizing transaction mixer Asymmetric message and data encryption Batteries included: Pool, casino, mixer, peer map Node options fully configurable All layers built from scratch 100% OpenSource Mainnet Port: 5658 Testnet Port: 2829 ","references#References":" Github Bismuth Mainnet "},"title":"Overview"},"/docs/papers/":{"data":{"":"","#":"\nBismuth Papers Categories Here are all categories listed.\nBismuth related Articles Bismuth Whitepaper (in several languages) References Research "},"title":"Papers"},"/docs/papers/articles/":{"data":{"":"","#":"\nBismuth Articles Semantic Interpretation - Jan Kucera, Jul 19, 2018\nShielded Tokens - Jan Kucera, Sep 20, 2019\nCrypto Interview with @tezosevangelist - Sep 29, 2017\nBismuth Developer Interview HCLivess - Mar 7, 2018\nBismuth — the first Python Blockchain - Jan 16, 2019\nBismuth - No ICO, No Premine and First Python Coin! - Oct 05, 2017\nHow to CPU Pool Mine Bismuth on Ubuntu 16.04 - July 15, 2017\nTEAMTALKS #32 — BISMUTH - August 8, 2019"},"title":"Articles"},"/docs/papers/references/":{"data":{"":"","#":"\nReferences to Bismuth IBM Patent – PatentHwang et al\nOptimizing Performance of a Blockchain\nPedro Pinheiro, Ricardo Santos, Ricardo Barbosa\nIndustry 4.0 Multi-agent System Based Knowledge Representation Through Blockchain\nSotirios Liaskos, Bo Wang, Nahid Alimohammadi\nBlockchain Networks as Adaptive Systems\nGeorge Bissias, David Thibodeau, Brian N. Levine\nBonded Mining: Difficulty Adjustment by Miner Commitment\nAlberto Leva, Silvia Strada, Mara Tanelli\nControl-oriented modelling of proof-of-work blockchains\nWei Zhou, Information Department, Beijing University of Technology, Beijing, China\nFuzzy rules based efficient event-driven simulation of blockchain-based applications"},"title":"References"},"/docs/papers/research/":{"data":{"":"","#":"\nAcademics and Research Nonlinear Feedback Control and Stability Analysis of a Proof-of-Work Blockchain - Geir Hovland and Jan Kucera\nSecurity of the Bismuth Blockchain - Geir Hovland and Jan Kucera\nTail Removal Block Validation: Implementation and Analysis - Geir Hovland and Jan Kucera"},"title":"Research"},"/docs/papers/whitepaper/":{"data":{"":"\nThe Bismuth Whitepaper is available in English, Korean, Japanese and Chinese.\nEnglish Bismuth Whitepaper\nKorean Bismuth Whitepaper\nJapanese Bismuth Whitepaper\nChinese Bismuth Whitepaper"},"title":"Bismuth Whitepaper"},"/exchanges/":{"data":{"":"","centralized-exchanges#Centralized Exchanges":"Xeggex Exchange Bismuth is listed at the Xeggex Exchange since Jan. 2024\nXeggex Exchange, visit Xeggex. Trading pair: BIS/ USDT - BIS/ LTC ","decentralized-exchanges#Decentralized Exchanges":"Since 2021, Bismuth has been tradable as Wrapped Bismuth (wBIS) on decentralized exchanges like Uniswap and PancakeSwap. Wrapped BIS, backed 1:1 by native Bismuth, can be exchanged via the Tornado Bismuth Wallet.\nPancakeswap wBIS / BSC Dextools Dex.guru Dexscreener Kyberswap Uniswap wBIS / ETH Uniswap Dextools Dexscreener Dex.guru ","market-data#Market Data":" Coingecko, visit Coingecko. Coinmarketcap, visit Coinmarketcap. Arkm, visit Arkm Cryptorank, visit Cryptorank. Coinpaprika, visit Coinpaprika. Blockspot, visit Blockspot. Livecoinwatch, visit Livecoinwatch. "},"title":"Buy Bismuth / Exchanges"},"/resources/":{"data":{"":"This is the resources page."},"title":"Resources"},"/wallet/":{"data":{"":"","bis-paper-wallet#BIS Paper Wallet":"The Paper Wallet can be used for cold storage BIS Paper (Github Link).\nGenerated private keys can be imported into Tornado Wallet ","bismuth-tornado-wallet#Bismuth Tornado Wallet":"The Tornado Wallet features Plugins (Crystals) such as Bismuth-Tokens, Eth-Bridge and Bsc-Bridge.\nSupports Windows, MacOS, Linux - Download Tornado Wallet (Github Link). ","tk-wallet#TK Wallet":"TK Wallet is the original wallet for the Bismuth blockchain.\nSupports Windows, Linux - Download TK Wallet (Github Link). "},"title":"Bismuth Wallet"}}